[
{
"title":"[18+] Mom & Daughter Sex Diet (2020)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/04/fpy0fht60zva.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/04/fpy0fht60zva.jpg",
"cate":"korea,18+",
"runtime":"73min",
"links":[
{"type":"HD 793MB", "link":"https://megaup.net/3xIkQ/Mom_&_Daughter_Sex_Diet_(2020).1080p_%7BDS%7D.mp4"},
{"type":"SD 444MB", "link":"https://megaup.net/3xIap/Mom_&_Daughter_Sex_Diet_(2020)_720P_%7BCM%7D.mp4"},
{"type":"HD 793MB", "link":"https://upstream.to/qkw0l7zepuyk"},
{"type":"SD 444MB", "link":"https://upstream.to/owtq7jxtlhqj"}
],
"review":"ဒီတစ်ခါလဲ ကိုရီးယားကား 18 + ကားလေးပါပဲ။ဇာတ်လမ်းလေးကတော့ တခြားကားတွေနဲ့မတူဖူး။ထူးခြားတယ်။အလုပ်မရှိတဲ့ဒုန်ဟီးဆိုတဲ့လူတယောက်အရင်က ဝနေတဲ့သူက ဝိတ်တွေဘာတွေကျပြီး ငွေရွှင်နေတယ်။
ဒါကိုသတိထားမိတဲ့သူ့ သူငယ်ချင်းတွေက
သားကြီး အဆင်ပြေလား ဘာညာ မေးရင်းနဲ့ ဒုန်ဟီးပွပေါက်တိုးနေတယ်ဆိုတာသိသွားတယ်။ဘာလဲဆိုတော့ ဘုရားလည်းဖူးလိပ်ဥလည်းတူး ဆိုသလိုဒုန်ဟီးတယောက် Gym သွားစရာမလိုပဲ ပိုက်ဆံရှာရင်းဝိတ်တွေချနေတာ။ဘယ်လိုလုပ်လဲသိချင်ရင်တော့ ဇာတ်ရှိန်တက်ရင်းHeat ယူရအောင် ဒေါင်းသာကြည့်ကြတော့။ပွဲတိုင်းကျော်ဘဲကြီးတွေ ဝိုက်ချက် ဝိုက်ချက်ဆိုတာလက်မလည်ဖူး။နည်းကောင်း လမ်းကောင်းလည်းသိချင်တယ်ဝိတ်လည်းကျချင်တယ်ဆိုတဲ့ဘဒိုတွေဒေါင်းလို့ကတော့အကျိုးမယုတ်ပါဖူး။သိတဲ့အတိုင်းကိုရီးယားကားတွေ ထုံးစံအတိုင်း ဆော်တွေကတော့ဖြူဖြူဖွေးဖွေးရေဆေးငါးကြီးတွေရှယ်လန်းတယ်။ဇာတ်လမ်းလေးကလည်း မြင်နေကျထက်ဆန်းတယ်။အဲ့ဒါလေးနောက်ဆုံးပိတ် ကြော်ငြာဝင်ချင်တယ်။ဘာသာပြန်ပေးထားတာကတော့Fox ဖြစ်ပြီး XCode မှတင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"[21+] Wife Impregnated by Her Father-In-Law",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/04/61u0wOZ0wzL._SL1000_.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/04/wCD0V-768x515.jpg",
"cate":"japan,21+",
"runtime":"1hr 16min",
"links":[
{"type":"HD 842MB", "link":"https://megaup.net/To9s/Immediate_Pregnancy_%E2%80%93_A_Wife_Who_Keeps_Her_Husband_Secretly_Father-in-law_And_Pregnancy_Affair_~_Yui_Hatano_[21+]_(MM_Sub).mp4"},
{"type":"HD 842MB", "link":"https://upstream.to/0ra767adyi46"}
],
"review":"ဇာတ်လမ်းအကျဉ်းလေးကတော့အလုပ်အရမ်းရှုပ်တဲ့ ယောကျာ်းကြောင့်

ဆန္ဒတွေ မပြည့်၀တဲ့မင်းသမီးလေးဟာ အမြဲစိတ်ညစ်နေရပါတယ်…

အဲ့တာနဲ့ပဲကြံရာမရတဲ့အဆုံး ယောက္ခထီး ဖြစ်သူကို မိန်းမမာယာနဲ့သိမ်းသွင်းပြီး
ဒန့်တန့်တန် လုပ်လိုက်ပါတယ်…

21+‌ဖြစ်တာကြောင့် 21ယောက်ပြည့်မှအဲလေ 21ပြည့်မှ ကြည့်ရှူကြပါခင်ဗျာ
 
ဘာသာပြန်ပေးထားတာ Dark Knight ဖြစ်ပြီး
Xcodeမှ တင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"[21+] I Will Lend You A New Amateur Girl,Momoka Kashiwagi (esthetician)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/04/3b775baddd441ab51c7aae671b5ebb26.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/04/118chn00180jp-1-1-341x512.jpg",
"cate":"21+,Japan",
"runtime":"2hr 15min",
"links":[
{"type":"Full HD 1.9GB", "link":"https://megaup.net/2RKd1/I_Will_Lend_You_A_New_Amateur_Girl._87_Pseudonym)_Momoka_Kashiwagi_(esthetician).mp4"},
{"type":"Full HD 1.9GB", "link":"https://upstream.to/f1ctay3msknv"}
],
"review":"~ Dark Side Production  ~Stay Home,Watch JAV.
I strongly recommend it is not for kids.
crd cm"
},
{
"title":"Sleeping Beauties (2017) 21+",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/04/MV5BYzIwY2FhZjUtOTE0YS00ZjMzLWEzYjAtNTNmYjgxNDg3ZTZhXkEyXkFqcGdeQXVyNDYzMDMxOTc@._V1_.jpg",
"cover":"https://image.tmdb.org/t/p/w300/bnh0vT5wIY61O7JzgI0cAC2BpXI.jpg",
"cate":"21+",
"runtime":"120min",
"links":[
{"type":"HD 874MB", "link":"https://megaup.net/3xHbw/Sleeping.Beauties.2017.1080p._%7BDS%7D.mp4"},
{"type":"SD 396MB", "link":"https://megaup.net/3xHbu/Sleeping.Beauties.2017_7200p._%7BDS.mp4"},
{"type":"HD 874MB", "link":"https://mega.nz/#!MM8RGb6b!zXOLP40EEL4mKRTCn7lArj6vFqrMoyeMtYbuN1GxDOY"},
{"type":"SD 396MB", "link":"https://mega.nz/#!YJ0FkTBT!oyoRz7yk_zGxJ2yxvG1u6_vU5ZaFqr7LgGLchR7APiI"},
{"type":"HD 874MB", "link":"https://upstream.to/u3grr5zx8xo7"},
{"type":"SD 396MB", "link":"https://upstream.to/ni37536c846u"}
],
"review":"ဇာတ်လမ်းအကျဉ်းလေးကတော့တရံရောအခါကတိုင်းပြည်တစ်ပြည်မှာ အလွန်လှပတဲ့မင်းသမီးလေးရှိတယ်ပေါ့ဗျာ.သူမကို အရမ်းချစ်တဲ့ မင်းသားလေးလဲ
ရှိတော့ သူငယ်ချင်းဖြစ်သု
မယဂရတ်က မနာလိုတာပေါ့.အဲ့တာနဲ့ပဲကျိန်စာတိုက်လိုက်တာမင်းသမီးလေးဟာ ထာဝရအိပ်ပျော်သွားပါလေရော.ဒီလိုနဲ့ပဲ အိပ်ပျော်လိုက်တာရာစုနှစ်များစွာကြာပြီး ယနေ့ခေတ်အခါကိုရောက်ရှိလာပါတော့တယ်.အဲ့အချိန်မှာ မင်းသမီးလေး အိပ်ပျော်နေတဲ့ရဲတိူက်ကြီးကို ဟိုတယ်အဖြစ်ပြောင်းဆောက်မယ့်အင်ဂျင်နီယာကိုကိုဟာ အိပ်ပျော်နေတဲ့မင်းသမီးလေးကို တွေ့တဲ့အခါအသည်းယားလို့ အာဘွားပေးမိလိုက်ပါတယ်.အဲ့အချိန်မှာ မင်းသမီးလေးဟာကျိန်စာပျယ်ပြီးတော့ နိုးထလာခဲ့ပါတယ်.သူမ နိုးထလာတဲ့အခါ သူမရဲ့ကျေးဇူးရှင်အင်ဂျင်နီယာကိုကိုကို ဘယ်လိုကျေးဇူးတုန့်ပြန်မယ်ဆိုတာကိုကွက်ကွက်ကွင်းကွင်း ဘွင်းဘွင်းရှင်းရှင်းရိုက်ပြထားတာကြောင့် dark sideဖန်တွေသဘောကျနှစ်ခြိုက်ကြမှာပါ။၂၁+ ဖြစ်တာကြောင့် ၂၁မပြည့်သူများမကြည့်သင့်ပါကြောင်းသတိပေးအပ်ပါတယ်ဗျာဘာသာပြန်ပေးထားတာကတော့ Dark Knight ဖြစ်ပြီးXCode မှ တင်ဆက်ပေးထားပါတယ်ငယ်ငယ်က နတ်သမီး ပုံပြင်ကို ခုတဖန်Live Action အဖြစ် မြင်ရမှာ ဖြစ်လို့ငယ်ဘ၀ အလွမ်းပြေ ကြည့်ဖို့ သူငယ်ချင်းတွေကိုလဲMention ခေါ်လိုက်ပါ။
crd cm"
},
{
"title":"Bosomy Tae-hee (2020)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/03/8n7wthcealtx.png",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/03/8n7wthcealtx.png",
"cate":"korea,18+",
"runtime":"120min",
"links":[
{"type":"HD 858MB", "link":"https://megaup.net/3xxrn/Bosomy_Tae-hee_(2020)_1080P_HD_%7BDS%7D_(2).mp4"},
{"type":"HD 858MB", "link":"https://mega.nz/file/YBM2XawI#jI9hYsy0AtGGDPo3IK9gn7UXrHV57WuC4Al6TXM-ico"}
],
"review":"Bosomy Tae-hee (2020)Dark Side အားပေးတဲ့ယောကျာ်းထုကြီးအပေါင်းမျှော်နေကြမယ်ထင်လို့ နောက်ထပ် ကိုရီးယား 18 အပေါင်းကားလေးနဲ့ထပ်ပြီး မိတ်ဆက်ပေးပါအုန်းမယ်။စာမေးပွဲအပြီး အိမ်တွင်းအောင်း ဂူအောင်းသိုင်းကျင့်မယ့်
သိုင်းဆရာတို့ ရိက္ခာလေးတွေကြိုဒေါင်းထားကြပါ။
ဇာတ်လမ်းလေးကတော့ နှစ်အိမ့်တစ်အိမ်ဟင်းလဲစားတဲ့အကြောင်းပါပဲ။အလုပ်တစ်ခုမှာအတူတူလုပ်ကြတဲ့စီနီယာ၊ဂျုနီယာနှစ်ယောက် မိန်းမတွေကိုယ်စီရှိကြပေမယ့်တမျိုးတည်းကြာကြာဝါးရင် အရိုးညက်တယ်ဆိုသလိုကိုယ့်မိန်းမ၊သူမိန်းမ လဲစားဖို့ စုံတွဲနှစ်တွဲခရီးအတူတူထွက်ရင်း ကြံစည်ကြလေသတည်းပေါ့။ဒီမှာပြောချင်တာက စီနီယာကတော့ ဂျပန်ကတုံးရုပ်မျိုးပေမယ့်သူမိန်းမလေးကတော့တော်တော် ချောတယ်ပြောရမယ်။Baby Face ကိုမှပါးချိုင့်လေးနဲ့။ဘရားသားတို့စိတ်ကူးယဉ်လို့ရမယ့် ဆိုဒ်မျိုး။သူလေးက တခြားဆော်တွေလိုမဟုတ်ဖူး။နူးနူးညံ့ညံ့ ငြင်ငြင်သာသာအထိအတွေ့လေးတွေကိုမှ ခိုက်တယ်။သူဘဲကြီးကတော့အဲ့လိုမဟုတ်ဖူး။ပညာလည်းစုံသလို ကြမ်းချင်တယ် ရမ်းချင်တယ်ပေါ့။စီနီယာကြီးရဲ့ ဆော်နဲ့ဆန့်ကျင်ဖက် ဂျူနီယာရဲ့ဆော်ကြီးကတော့ကြမ်းကြမ်းတမ်းတမ်းမှကြိုက်တာ။အဲ့ဆော်ကြီးကတော့ ရုပ်ကအရမ်းကြီးအချောကြီးမဟုတ်ပေမယ့် Technique ကတော့ကျွမ်းတယ်ပြောရမယ်။ဆက်ပြောရရင် သိုင်းကားတွေထုံးစံအတိုင်းတယောက်တလဲစားကြမယ့်အစီအစဉ်ကို ဆော်ကြီးတွေကလည်းသိသိကြီးနဲ့မသိချင်ယောင်ဆောင်ကြလေသတည်းပေါ့။စီနီယာကိုရီးယားကတုံးရဲ့ဆော်ကို ဖန်ရတာလွယ်ပေမယ့်ခက်နေတာကဂျူနီယာရဲ့ဆော်။ခရီးထွက်လာတဲ့ညမှာတင် အတွဲနှစ်တွဲသောက်ကြစားကြရင်းအဲ့ညမှာ ဂျူနီယာကတော့ စီနီယာဘဲရဲ့ဆော်ချောချောလေးကိုဖန်ပြီးစားသောက်ပြီးစီးသွားပေမယ့် စီနီယာဘဲကြီးတယောက်ကတော့ဘယ်လို နည်းလမ်းတွေသုံးပြီး ဂျူနီယာဆော်ကိုတီးရမလဲဆိုတာ ဂွကျနေတယ်။ဘာလို့လဲဆိုတော့ အဲ့ဂျူနီယာဘဲရဲ့ဆော်ကြီးကအရက်မူးရင်သွေးဆိုးတယ်။အဲ့မှာနည်းနည်းပြဿနာတက်နေတာ။ဒါနဲ့ သူ့မိန်းမကိုအပူကပ်ပြီး အဲ့ဂျူနီယာရဲ့ဆော်ကြီးကို ဖြုတ်ဖို့အကူအညီတောင်းတာပေါ့။သူမိန်းမကလည်းသူယောကျာ်းကို ကြောက်ရတော့ကူညီပေးလိုက်တယ်ပေါ့။အဲ့မှာ အဲ့ဘဲကြီးရဲ့ ရှယ်စားမယ့် စီမံကိန်းကြီးလည်းအောင်မြင်သွားပြန်တယ်။ဒါပေမယ့်အဲ့ဘဲကြီးမသိတာကသူတို့မိန်းမတွေကလည်းသူတို့ကိုလက်စားချေဖို့ကြံစည်နေတယ်ဆိုတာကိုပဲ။ကဲ ဆက်ပြောရင်ဇာတ်လမ်းပေါ့မှာဆိုလို့ မပြောတော့ဖူး။သိချင်ရင်ဒေါင်းသာကြည့်ကြ။အဲ့ထဲကစီနီယာဘဲကြီးရဲ့ဆော်လေးကတော့နုနုထွတ်ထွတ်လေးနဲ့ ဂျပန်မလေးတွေဆိုဒ်မျိုးစကားပြောရင် မပွင့်တပွင့်လေးနဲ့ရုပ်လေးကတော်တော်ချောတယ်ဆိုတာတော့ညွှန်းလိုက်ပါရစေ။အဲ့ဆော်နှစ်ယောက်ဘဲကြီးနှစ်ယောက်အပိုးကျိုးသွားအောင်ဘယ်လိုချေမယ်၊ဘယ်လိုပညာခန်းတွေသုံးမယ်ဆိုတာတော့နားကြပ်တပ် ဂူအောင်းပြီး သိုင်းကျင့်ရင်းခံစားကြည့်လိုက်ကြပါ။DarkSide အတွက် ဖန်တီးဘာသာပြန်ပေးထားတာကFox ဖြစ်ပြီး XCode မှ တင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"Lazy Hazy Crazy (2015)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2018/08/04q2dhaapxol.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2018/08/2018-08-15_2-03-00-512x218.jpg",
"cate":"18+",
"runtime":"100min",
"links":[
{"type":"HD 1GB", "link":"https://megaup.net/2bCxq/Lazy.Hazy.Crazy.2015.1080p.BluRay_%7BDS%7D_(2).mp4"},
{"type":"HD 1GB", "link":"https://mega.nz/file/kENiSQQI#7PIXJxUgVCGzlTJA6fSrVUBbA5Gb71XQYY751ofPOrU"}
],
"review":"အမှန်ဆို 18+ ဆိုတာနဲ့အိပ်ရာပေါ် ဝုန်းဒိုင်းပြေးတက်ဒချိ ဒချိ တွေ ကို ကျနော်တကယ်ကြီး မကြိုက်ပါဘူး
တစ်ခါလာလဲ ဝုန်း တစ်ခါလာလဲဝုန်း
ဇတ်လမ်းဇတ်ကွက်က ဝုန်းတဲ့ ဇတ်ဆိုPron ကားတွေ ကြည့်တာပဲ အကျိုး ရှိပါတယ်..ကျနော် အရမ်းကြိုက်တဲ့ 18+ ထဲ မနက်ဖြန်တင်မယ့် ရုပ်ရှင်ကားလေးလဲ ပါပါတယ်…တရုတ်မလေး ကျောင်းသူ ၃ ယောက် ရဲ့ဖြစ်ရပ်မှန် ဇတ်လမ်းလေး တစ်ပုဒ် ပါ…ချွိုင် ၊ ပင်ကီ ၊ ထရေစီ ဆိုတဲ့ သုံးယောက်ပါချွိုင် နဲ့ ပင်ကီ က အိမ်ကို အားမကိုးပဲ ကျောင်းလခအိမ်ငှားခ တွေကို ရှာနေကြရတဲ့သူတွေပါဘယ်လိုရှာလဲတော့ မမေးနဲ့ We Chat လိုအကောင့်တွေကနေ အော်ဖာ ရှာပါတယ်တစ်ညအိပ် ၅ ထောင်လောက် ခိုင်တယ်လူကသာ အထက်တန်း ကျောင်းသူပညာကတော့ အိမ်ရှင်မ အဆင့်ကျော်နေပါပြီ…သူတို့ သူငယ်ချင်း အရိုးခံလေး ထရေစီ ကတော့အဖွားဖြစ်သူ အိမ်မှာ ကပ်နေရတာ ဖြစ်ပြီးအချုပ်ချယ် ခံရသူလေး ဖြစ်ပါတယ်….ချွိုင် နဲ့ ပင်ကီ တို့ အလုပ်တွေကို သူသိပြီးလိုက်ချင်ခဲ့ပေမယ့် သူငယ်ချင်း ၂ ယောက်ကသူမ ကိုပါ ဒီလို အဖြစ်ထဲ ဆွဲမခေါ်ချင်တဲ့ အတွက်တစ်ခါမှ အပြင်ကို မခေါ်သွားဖူးပါဘူး….တစ်ခါတစ်လေ သူတို့ အလုပ်က ထိတ်လန့်ရပါတယ်Video Cam တွေ Phone Cam တွေ နဲ့ခိုးရိုက်ခံရမှာလဲ လန့်ရပါတယ်ကျောင်းတက်နေတဲ့ ကျောင်းသူတွေ ဆိုတော့ကျောင်းထုတ်ခံလိုက်ရနိုင်တယ်လေ….ထရေစီ ကတော့ ယောင်္ကျားတွေနဲ့ အထိအတွေ့မရှိတဲ့သူ ပီပီ သူငယ်ချင်း ၂ ယောက် စီကနေအတွေ့အကြုံတွေ နားထောင်ရတာပေါ့…ဇတ်လမ်းလေးက ရိုးသလို နဲ့ ဆန်းတယ်ဘာပဲဖြစ်ဖြစ် CM က တင်တဲ့ အခါစောင့်ကြည့်သင့်တဲ့ ရုပ်ရှင်လေးပါဒီတစ်ခါ အကြံပြုချင်တာကမိန်းကလေးတွေပါကြည့်သင့်ပါတယ်ပညာပေး ဇတ်လမ်းလို့ မှတ်ပြီး ကြည့်ပါယောင်္ကျားလေးတွေကတော့ ကြည့်ရတာတန်ပါတယ်…ကောင်မလေးတွေက ချစ်စရာလေးတွေပါဖျင်လေးတေ လုံးနာဖဲဒီရုပ်ရှင်ကားကို Jueno မှ ဘာသာပြန်ပေးထားပြီးXCode မှ တင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"Friend Mom And Affairs (2019)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/03/wodjabghhczc.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/03/wodjabghhczc.jpg",
"cate":"korea,18+",
"runtime":"80min",
"links":[
{"type":"HD 870MB", "link":"https://megaup.net/Pzrw/Friend.Mom.And.Affairs.2019.1080p_%7BDS%7D.mp4"}
],
"review":"Dark Side ပရိတ်သတ်တွေအတွက်နောက်ထပ်ကိုရီးယား ၁၈ အပေါင်းကားလေးထပ်လာပါပြီ။၁၈ယောက်စုကြည့်ရတဲ့ကားဆိုပေမယ့်ဒီကားလေးက တခြားကားတွေနဲ့မတူပဲဇာတ်လမ်းဇာတ်အိမ်အရကော ဆော်တွေကိုဖြုတ်တာရောက
နည်းနည်းလေးကြမ်းထားပါတယ်။
ဇာတ်လမ်းကတော့အားလုံး သိနေကြတဲ့ကျောရိုးပုံစံပါပဲ။ပိုက်ဆံမက်တဲ့အသက် ၃၀ ကျော်အရွယ်ဟောယောင်းဆိုတဲ့ မမအပြိုကြီးကသူထက်အသက်နှစ်ပြန်လောက်ကြီးတဲ့ ရှုးဂါးဒယ်ဒီကြီးနဲ့ယူလိုက်ပါတယ်။ဒါပေမယ့် အဲ့ဘဲကြီးကတော့ဇာတ်လမ်းထဲမပါပါဖူး။တကယ်ဖုတ်တာက အဲ့ဆော်ကြီးရဲ့အရင်Ex ပါ။သူEx ကိုကျ ဟောယောင်းကပိုက်ဆံမရှိလို့ဆိုပြီးဖြတ်ခဲ့တာပေါ့။ပြီးတော့ သူယူလိုက်တဲ့ စားဘဲကြီးဆီမှာ အွန်းဂျူဆိုတဲ့သမီးရှိတယ်။အဲ့သမီးအသက်က ဟောယောင်းထက်တောင်တနှစ်ကြီးသေးတယ်။ဇာတ်လမ်းပြန်ဆက်ရရင် အမေထက်သမီးတစ်နှစ်ကြီးဆိုသလိုပဲ။ကံကြမ္မာကဖန်လိုက်တာက အဲ့ဒီအွန်းဂျူနဲ့ ဟောယောင်းရဲ့အရင် ex နဲ့တည့်တည့်တိုးတော့တာပဲ။အွန်းဂျူကလည်းရေငတ်တုန်းရေတွင်းထဲကျဆိုသလို။သူမိထွေးရဲ့အရင် Ex ကြီးနဲ့ တဖန် ဖုတ်ကြလေသတည်းပေါ့။နောက်တော့အွန်းဂျူကအပြင်မှာတင် ဒချိရတာအားမရတော့အဲ့ဘဲကိုအိမ်အထိခေါ်လာတယ်။အိမ်ရောက်တော့အမေကောသမီးကောတယောက်တလှည့်ခရမ်းသီးတစ်လုံးကိုလုစားကြပါတော့တယ်။ကိုရီးယားဆိုတဲ့အတိုင်း နည်းနည်းလေးတော့နောက်ဆုံးခန်းမှာပညာပေးသွားတဲ့ဇာတ်လမ်းလေးတော့ပါတာပေါ့။အဲ့သားအမိနှစ်ယောက် ဘဲတစ်ယောက်တည်းကိုဘယ်လိုဝေစားမျှစားမယ်၊ဘယ်လိုတွေပညာခန်းတွေပြကြမယ်ဆိုတာတော့သိချင်ရင်ဒေါင်းကြည့်လိုက်တော့။အသက်ကြီးပေမယ့်မပျက်စီးသေးတဲ့ မမတွေ ဖြူဖြူဖွေးဖွေးရေဆေးငါးကြီးတွေကမနူးမနပ်လေးတွေထက်စာရင် တော်တော်လည်းဆရာကျတာမို့လို့သိုင်းလောကသားတူမောင်တို့တွေကြည့်ပြီးပညာယူလိုက်ကြပါလို့ပဲ ညွှန်းချင်ပါတယ်။ဒီကားကို ဘာသာပြန်ပြီး အညွှန်းရေးပေးထားတာကFox ဖြစ်ပြီး XCode မှ တင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"She and Auntie live together (2019)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/03/urmjfzitwthp.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/03/urmjfzitwthp.jpg",
"cate":"korea,18+",
"runtime":"68min",
"links":[
{"type":"HD 500MB", "link":"https://megaup.net/2ee7w/She.and.Auntie.live.together.2019_720P_%7BCM%7D.mp4"},
{"type":"HD 500MB", "link":"https://mega.nz/file/fg43GIZD#cyh6OPL9OG3gdrU2oQMcJn4F6U2DW8G0OPb87cxB_is"},
{"type":"HD 500MB", "link":"https://upstream.to/efneeue6in1e"}
],
"review":"ဒီတစ်ခါ Dark Side ပရိသတ်ကြီးအတွက်ခပ်လန်းလန်း စားဆော်ကြီး အကြောင်းရိုက်ထားတဲ့ကိုရီးယားကားခပ်ကြမ်းကြမ်းလေးလာပါပြီ။မင်းသမီးကပြောရရင် စာရေးဆရာမပေါ့။လှတယ်ချောတယ် ကိုယ်လုံးကိုယ်ပေါက်ကလည်း ကိတ်တယ်။
ဘဲလည်းမရှိဖူး။တကိုယ်တည်းနေတဲ့ အထီးကျန်မမပေါ့။
သူကပြောရရင် အပြာစာအုပ်တွေရေးတဲ့တောင့်တောင့်ဖြောင့်ဖြောင့် စာရေးဆရာမမပါ။ထူးဆန်းတာကသူစာရေးခါနီး အာရုံမရရင်အတွေ့အကြုံလေးတွေကို ကိုယ်တိုင်ခံစားပြီးမှရေးတတ်တယ်။နောက်တစ်ချက်က တစ်ယောက်တည်းနေရတာကြောက်တယ်ဘာညာ အဲ့လိုပေါ့။အဲ့လိုရေးဖို့အတွက်ပိုက်ဆံလည်းချမ်းသာတဲ့ Sugar Mommy မမချောကအပန်းဖြေစံအိမ်လိုအိမ်ကြီး တစ်လုံးငှားပြီးအတူနေဖို့ လူတွေ တစ်ယောက်ပြီးတစ်ယောက်ရှာပုံတော်ဖွင့်တော့တာပေါ့။အဲ့အထဲမှာ ဆော်လည်းပါတယ်။တစ်ယောက်ပြီးတစ်ယောက်ဆီကအတွေ့အကြုံလည်းယူတာပေါ့။ဆန္ဒလည်းဖြည့်တယ်ပေါ့လေ။နောက်တော့အတူတူနေရင်းနဲ့အကျင့်စရိုက်မတူတာ၊အကြိုက်မတူတာတွေကြောင့်တစ်ရွာမကောင်းသူကောင်းမဖြစ်ဆိုသလိုတစ်ယောက်ပြီးတစ်ယောက်ပြောင်းတယ်။နောက်ဆုံးတော့မှပဲအဲ့ဒီမမစိတ်တိုင်းကျတဲ့သူတွေ့သွားတော့တယ်။သူကဘယ်သူမို့လို့လဲ။ကိုရီးယားဆိုတော့ ဇာတ်လမ်းဇာတ်အိမ်လေးနဲ့ တင်ဆက်ထားပြီးခေါင်းဆောင်မင်းသမီးကလည်းတော်တော်သရုပ်ဆောင်တာ အသက်ဝင်တယ်ပြောရမယ်။အနုအလှတွေနဲ့ ဘယ်လိုတင်ဆက်ပေးမယ်ဆိုတာသိချင်ရင်အမြန်ဆုံးဒေါင်းလိုက်ပါလို့ နောက်ဆုံးပိတ်မှာချင်ပါတယ်။ဒီ ရုပ်ရှင်ကားကို Fox က ဘာသာပြန်ပေးထားပြီးXCode မှ တင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"Invitation Girl 2 (2019)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/03/gy2dratcrrzy.png",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/03/gy2dratcrrzy.png",
"cate":"korea,18+",
"runtime":"76min",
"links":[
{"type":"HD 552MB", "link":"https://mega.nz/file/SgxHVKAT#wsPG6WerOgUxLRX19YqRC8G56J2n34DjIKdQR4jb_r0"},
{"type":"HD 552MB", "link":"https://upstream.to/gu5v7yamdnks"}
],
"review":"ကဲ Dark Side ပရိတ်သတ်ကြီးကို ၂၀၁၉ ခုနှစ်ထွက်၁၈ အပေါင်း ကိုရီယားကားကောင်းလေးနဲ့မိတ်ဆက်ပေးမယ်။ဇာတ်လမ်းကတော့ လင်မယားနှစ်ယောက်နေ့တိုင်းဟင်းတစ်မျိုးတည်းပဲ စားနေရတော့ ရိုးအီလာတာပေါ့။တစ်ခါတစ်လေ ကြက်ကြော်စားချင်တဲ့နေ့ရှိသလိုတစ်ခါတစ်လေလည်းချဉ်ပေါင်ဟင်းနဲ့စားချင်တယ်ဆိုတာမျိုး။အဲ့လိုရိုးအီနေတာကို သိတဲ့ယောကျာ်းဖြစ်သူကလင်မယားနှစ်ယောက်ကြား အချစ်တွေ အနည်မထိုင်သွားရအောင်သူသွားနေကြ ကလပ်က အတွဲတစ်တွဲကိုပါတနာလဲစားဖို့အကြံနဲ့ သူတို့အိမ်ကိုခေါ်လာတယ်။အဲ့အတွဲကလည်း ဇမသေးဖူး။ချက်ဆိုနားခွက်ကမီးတောက်တဲ့အမျိုး။သူမိန်းမကလည်း ပြောရရင် တော်တော်လေးအသစ်ကို တောင်းတနေတဲ့အချိန်ဆိုတော့ကွက်တိဖြစ်သွားတယ်။ကဲ ဒီလောက်ဆို ဒီကားဒေါင်းကြည့်မယ့်ပုရိသအပေါင်းလည်း ဇာတ်လမ်းအဆင်ကဘယ်လိုလာမယ်ဆိုတာသိမယ်ထင်ပါတယ်။မင်းသမီးနှစ်ယောက်က တယောက်ဖွံ့ဖွံ့ထွားထွားနဲ့တစ်ယောက်က LCD ပေမယ့်စကေးကျွမ်းတဲ့ အလန်းလေးဆိုတော့ဘယ်လို type ပဲကြိုက်ကြိုက် အဆင်ပြေလို့ ကြည့်ရတာတန်မှာပါ။လက်နှေးလို့ ခွက်မဆေးရခင် Dark Side ပရိတ်သတ်ကြီးဇာတ်လမ်းလေးနဲ့မှကြည့်ချင်ပါတယ်ဆိုတဲ့ကိုရီးယား Fan တွေအမြန်ဒေါင်းလိုက်ပါတော့လို့ မောင်းတီးလိုက်ပြီနော်။ဘာသာပြန်ပြီး အညွှန်းကို ဂျွတ်စကေး ရေးပေးထားတာကတော့Fox ဆိုတဲ့ DarkSide Translator အသစ်လေး ဖြစ်ပြီးအိုးဒိ ကြီး XCode မှ တင်ဆက်ပေးထားပါတယ်
crd cm"
},
{
"title":"Kiss and Kill (2017)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/03/MV5BZDExMWE2MGEtYjJlNi00NDE1LThiMGMtN2ZiOWZkN2JjNWYzXkEyXkFqcGdeQXVyODEwNjkyNjY@._V1_SY1000_CR007061000_AL_.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/03/MV5BZDExMWE2MGEtYjJlNi00NDE1LThiMGMtN2ZiOWZkN2JjNWYzXkEyXkFqcGdeQXVyODEwNjkyNjY@._V1_SY1000_CR007061000_AL_.jpg",
"cate":"21+",
"runtime":"",
"links":[
{"type":"HD 873MB", "link":"https://megaup.net/SCdm/Kiss.and.Kill.2017.1080p_%7BDS%7D.mp4"},
{"type":"HD 873MB", "link":"https://mega.nz/file/q1kXhaRD#78H1JlUvqSsFkTSwbNdp3nO6-5tPbvoCTSIa2AZl9p4"},
{"type":"HD 873MB", "link":"https://upstream.to/fdujfywo4a1j"}
],
"review":"
ဒီကားလေးတော့ drama/thriller/ romance/mystery ဇာတ်ကားလေးပါ.ဒီ ဇာတ်လမ်းလေးကို အစပြုပုံကတော့ စီးပွားရေး သောင်းကျန်းပြီးဇနီးမယားအလှပဂေးလေးကို ပစ်ထားမိရာကနေ စတာပါပဲ ….ဓာတုကုမ္ပဏီ သူဌေးရဲ့ ဇနီးမယားအချောအလှလေးဖြစ်တဲ့ကေတီဟာ စီးပွားရေးကိုပဲ အာရုံစိုက်ပြီး သူမရဲ့ ဆန္ဒတွေကို
ဖြည့်ဆည်းမပေးတဲ့ ခင်ပွန်းဖြစ်သူကို စိတ်ကုန်လာတဲ့အခါ
သူငယ်ချင်းမတစ်ယောက်ရဲ့ မြှောက်ပင့်မှုနဲ့ဘားကယောက်ျားတစ်ယောက်နဲ့ သူမရဲ့ ဆန္ဒတွေကိုဖြည့်ဆည်းဖို့ကြိုးစားခဲ့ပါတယ်.ကံဆိုးမသွားရာ မိုးလိုက်လို့ရွာဆိုတဲ့အတိုင်း ကံဆိုးမလေးကေတီဟာဘယ်ကမှန်းမသိ ဘယ်သူမှန်းမသိတဲ့ ဘားကလူနဲ့ အိပ်စက်ပြီးသူမရဲ့ ဆန္ဒတွေကို ဖြည့်စည်းပြီး နောက်မှာ နောက်ဆက်တွဲအကျိုးဆက်တွေကတော့ မကောင်းလှဘူးပေါ့….ဘယ်လိုမကောင်းတာလဲ ဆိုတာကတော့ ပရိသတ်ကြီးကြည့်ရှူခံစားရင်း သိမြင်လာမှာပါ…..21+လေး ဖြစ်တာကြောင့် မိသားစုနဲ့21အောက်ကလေးများကြည့်ရှုဖို့ အဆင်မပြေပါဘူး ခင်ဗျာunicodeဒီကားလေးတော့ drama/thriller/ romance/mystery ဇာတ်ကားလေးပါ.ဒီ ဇာတ်လမ်းလေးကို အစပြုပုံကတော့ စီးပွားရေး သောင်းကျန်းပြီးဇနီးမယားအလှပဂေးလေးကို ပစ်ထားမိရာကနေ စတာပါပဲ ….ဓာတုကုမ္ပဏီ သူဌေးရဲ့ ဇနီးမယားအချောအလှလေးဖြစ်တဲ့ကေတီဟာ စီးပွားရေးကိုပဲ အာရုံစိုက်ပြီး သူမရဲ့ ဆန္ဒတွေကိုဖြည့်ဆည်းမပေးတဲ့ ခင်ပွန်းဖြစ်သူကို စိတ်ကုန်လာတဲ့အခါသူငယ်ချင်းမတစ်ယောက်ရဲ့ မြှောက်ပင့်မှုနဲ့ဘားကယောက်ျားတစ်ယောက်နဲ့ သူမရဲ့ ဆန္ဒတွေကိုဖြည့်ဆည်းဖို့ကြိုးစားခဲ့ပါတယ်.ကံဆိုးမသွားရာ မိုးလိုက်လို့ရွာဆိုတဲ့အတိုင်း ကံဆိုးမလေးကေတီဟာဘယ်ကမှန်းမသိ ဘယ်သူမှန်းမသိတဲ့ ဘားကလူနဲ့ အိပ်စက်ပြီးသူမရဲ့ ဆန္ဒတွေကို ဖြည့်စည်းပြီး နောက်မှာ နောက်ဆက်တွဲအကျိုးဆက်တွေကတော့ မကောင်းလှဘူးပေါ့….ဘယ်လိုမကောင်းတာလဲ ဆိုတာကတော့ ပရိသတ်ကြီးကြည့်ရှူခံစားရင်း သိမြင်လာမှာပါ…..21+လေး ဖြစ်တာကြောင့် မိသားစုနဲ့21အောက်ကလေးများကြည့်ရှုဖို့ အဆင်မပြေပါဘူး ခင်ဗျ
crd cm"
},
{
"title":"My Girlfriend’s Elder Sister Is A Horny Bitch,Erika Momotani",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/03/20150707072618_375.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/03/C1gNzSeWgAYEPB6-768x461.jpg",
"cate":"japan,21+,uncensored",
"runtime":"2hr 7min",
"links":[
{"type":"HD 1.3GB", "link":"https://megaup.net/Pnda/[DS][ABP-171]_(decensored)_My_Girlfriend_s_Elder_Sister_Is_A_Horny_Bitch_Who_Leads_Me_To_Temptation._Erika_Momotani.mp4"},
{"type":"HD 1.3GB", "link":"https://mega.nz/file/ax1R1LoD#u-ApdCJ9FLXaTyXyAndBQaZGwDfN-4vhPKt9_v5CYRk"},
{"type":"HD 1.3GB", "link":"https://upstream.to/bjav7av3c42o"}
],
"review":"Decensored Version ဖြစ်တာကြောင့် သာမန် Japan ကားတော့မဟုတ်ပါဘူး..
ရှင်းရှင်းပြောရရင် မဝါးဘဲ ရှင်းတာမျိုးပါ…
:3
ဇာတ်လမ်းကတော့ ညီအစ်မ ၂ ယောက် ကောင်လေး ၁ ယောက်ကို ဘယ်လိုအမဲဖျက်ကြမလဲဆိုတာ
ဝမ်းနည်းစွာ ကြည့်ရှုရမှာပါ။
crd cm"
},
{
"title":"[18+]Scarlet Innocence(2014)",
"poster":"https://image.tmdb.org/t/p/w185/ejaHQQKp5J2tD6ubprDMmIRGKnE.jpg",
"cover":"https://image.tmdb.org/t/p/w185/ejaHQQKp5J2tD6ubprDMmIRGKnE.jpg",
"cate":"korea,18+",
"runtime":"1hr 53min",
"links":[
{"type":"HD 900MB", "link":"https://megaup.net/Ruwf/Scarlet_Innocence_2014_.BLU-RAY.720P.PP.mp4"},
{"type":"HD 900MB", "link":"https://upstream.to/f5shap2xz56a"}
],
"review":"တစ်ချို့သော ကိုရီးရား အချစ်ကားတွေဟာ တော်ရုံ adult ကားတွေထက်
ဆွဲဆောင်မှုရှိကြတယ်လို့ဆိုကြတယ်…အဲ့ဒီကားတွေထဲမှာ
Scarlet Innocence (2014) လည်းအပါအဝင်ဖြစ်တယ်…ကြည့်ဖူးတဲ့သူတွေသိကြသလို
အကြည်လေး သိမ်းထားချင်တဲ့သူတွေအတွက်ရော မကြည့်ရသေးတဲ့သူတွေအတွက်ရော
တင်ဆက်ပေးလိုက်တယ်…ဒီကားက ဇာတ်လမ်းလည်းကောင်းမွန်လှသလို
မင်းသားမင်းသမီးတွေကလည်း နာမည်ကြီးတွေပါပဲ…
(18+)လူကြီးခန်းများ အများအပြားပါတာမို့ မိသားစုနဲ့အတူ မကြည့်သင့်ပါဘူး…
ထွေထွေထူးထူးညွှန်းစရာမလိုတဲ့ကားကောင်းမို့
ခံစားကြည့်ကြပါဦးလို့ပဲပြောပါရစေ…
ဇာတ်လမ်းအညွှန်းနဲ့ ဘာသာပြန်သူကတော့ Fliex ပဲဖြစ်ပါတယ်…
crd cm"
},
{
"title":"[18+] Seduction (2017)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/02/s.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/02/s.jpg",
"cate":"18+",
"runtime":"",
"links":[
{"type":"HD", "link":"https://megaup.net/Ueq2/Seduction_[18+]_[2017]_(MM_Sub).mp4"},
{"type":"HD", "link":"https://upstream.to/e20p0ernkie6"}
],
"review":"သင်သာ အချစ်ကို အဓိပါယ်ဖွင့်ဆိုရမယ်ဆို ဘယ်လိုဖွင့်ဆိုမိမလဲ ….သစ္စာတရားကိုတော့ မပါမဖြစ် ဖွင့်ဆိုမိကြမှာပေါ့…ဒီဇာတ်ကားကြည့်ပြီးရင်တော့ အဲ့သစ္စာတရားဆိုတာ ပေါက်စီနှစ်လုံးလား စမူဇာတစ်ခုလား အီကြာကွေးတစ်ချောင်းလားဆိုတာ မေးစရာတောင်ဖြစ်လာခဲ့ပါပြီ…ဒီဇာတ်ကားမှာ အဓိကပါမှာကတော့ လင်မယားနှစ်ယောက်ရယ် ခပ်ငယ်ငယ် ဒေါင်ကောင်းကောင်း ကီမုချိလို စွခွက်နဲ့ ကြာကူလီတစ်ကောင်ပါပါမယ် (စတာ တို့ ကီမုချိ က ပိုချောတယ် ငိငိ)လင်မယားနှစ်ယောက်မှာ ယောကျာ်းဖြစ်သူက ခွေးလိုနွားလို အလုပ်လုပ်ပါတယ် … ညမအိပ်ပဲအလုပ်လုပ်တာကြောင့် စမူစာငတ်ပါတယ်စမူဇာသည်ကလည်း သူ့စမူစာကို ဖောက်သည်က ဝယ်မစားတော့ အတင်းထိုးရောင်းချင်နေပါတယ်ဒီလိုနဲ့ စောစောက ကြာကူလီကောင်နဲ့ ကားတိုက်မိသလို ဖြစ်ရင်းစတွေ့ပါပြီစမူစာရောင်းချင်သူနဲ့ စမူဇာနှိုက်မြည်းချင်သူတို့ ဆုံတွေ့ပြီးနောက် ဘာဆက်ဖြစ်မလဲဆိုတာ ကြည့်ပြီးdown မှားလို့ downပြီးကြည့် (ငိုးမ လင်းမူ) ဘာမှမဆိုင်လည်းဆဲတယ် :3ဒီဇာတ်ကားကတော့ ခင်ဗျားတို့ အိမ်သာတက်ရင်း ကြည့်နေကျ ဂျပန်ကားတွေနဲ့တောင်သွားဆင်ပါသေးတယ်အညွှန်းရေးတာကတော့ Dark Devil ပါ ။Trans : NatsuEncoder : Dark Devil
crd cm"
},
{
"title":"Confinemet Incontinence Uniform Slave (2014)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/01/1.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/01/1.jpg",
"cate":"japan,18+",
"runtime":"",
"links":[
{"type":"Full HD 1.86MB", "link":"https://mega.nz/file/VEQ1zawb#pXpIvXhB93DAPa5hEYrcgmGTB25xPPIPZ1zr4qtPiZk"},
{"type":"Full HD 1.86MB", "link":"https://upstream.to/4jv7us6upwtf"}
],
"review":"Dark Side ဖန်တွေ အတွက် တစ်ရက် တစ်ကားဆိုသလိုဖန်တီးပေးမယ့် Dark Knight နဲ့ XCode တို့ထပ်မံ ပူးပေါင်း တင်ဆက်ပေးလိုက်တာကတော့ပြန်ပေးဆွဲခံရတဲ့ ကောင်မလေး ဇတ်လမ်းပါပဲ
ညဘက် အချိန်ပိုင်းအလုပ်ကနေ ပြန်လာတဲ့
အချိန်ပိုင်း ကျောင်းသူလေးဟာ ပြန်လိုက်ပို့ပေးမယ်လို့လိမ်ညာခေါ်တဲ့ ကိုကိုလူချောနောက်ကောက်ကောက်ပါအောင် လိုက်သွားပြီးပြန်ပေးဆွဲပြီး ဝိုင်း ဘု တာ ခံရပါရောလားပြန်ပေးဆွဲတာတွေ နောက် ပါသွားတဲ့ကျောင်းသူလေး ပြန်လွှတ်ပါ့မလားသူဘယ်လိုတွေ ကြိုးစားမလဲ ဆိုတာရင်တုန်ခံစား ကြည့်ရှုလိုက်ကြပါအုံး၁၈ ပလပ် ဇတ်ကားကိုအိပ်ရေးတွေပျက် အားတွေချိနဲ့စွာဘာသာပြန်ပေးထားတာကတော့Dark Knight ဖြစ်ပြီးစေတနာ ဗရပွ နဲ့ JAV အလန်းတွေတင်ဆက်ပေးနေတာကတော့XCode တို့ပဲ ဖြစ်ပါတယ်…Dark Side ဖန်တွေရေ ရယ်ဒီပဲလား ?
crd cm"
},
{
"title":"[21+] Demon Slayer, Mitsuki Nagisa",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/12/337361f2.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/12/Capture-768x520.png",
"cate":"21+,Japan",
"runtime":"2hr 15min",
"links":[
{"type":"HD 1.2GB", "link":"https://megaup.net/2S64i/[DS]CSCT-002.Pussy_Slayer.Mitsuki_Nagisa_.2019.mp4"},
{"type":"HD 1.2GB", "link":"https://mega.nz/file/IJJTAQAb#8pJ-f1UYO8hEkf-nLA3mvQi5JwCC__EfQqZmDlG_-EA"},
{"type":"HD 1.2GB", "link":"https://upstream.to/vasqaijcqmou"},
{"type":"HD 1.2GB", "link":"https://www.mediafire.com/file/d802x9fzh48yqp8/%5BDS%5DCSCT-002.Pussy_Slayer.Mitsuki_Nagisa_.2019.mp4/file"}
],
"review":"[ Dark Side Production မှတင်ဆက်သည်။]ဒါကတော့ ၂၀၁၉ မှာ ထွက်ရှိခဲ့တဲ့ နာမည်ကြီး Anime Serie တစ်ခုဖြစ်တဲ့ Demon Slayer (Kimetsu No Yaiba) ကို xxx prody အနေနဲ့ ပြန်လည်တင်ဆက်ထားတဲ့ကားလေးပဲဖြစ်ပါတယ်
ဒီဇာတ်လမ်းမှာ အဓိကဇာတ်ဆောင်ဖြစ်တဲ့ Nezuko Kamado ဆိုတဲ့ Demon မလေးဟာ သူ့ရဲ့ လူသားဘဝကို ပြန်ရောက်ဖို့အတွက် ကြိုးစားလှုပ်ရှားရုန်းကန်ရပုံတွေကို ရှုစားရမှာပဲ ဖြစ်ပါတယ်Nezuko လေးရဲ့ အစ်ကိုဖြစ်သူ Tanjiro Kamado အနေနဲ့လည်း ညီမဖြစ်သူကို လူသားအဖြစ်ပြန်ရစေဖို့ ကြိုးစားထားလေရဲ့Nezuko အဖြစ် မင်းသမီးချောလေး Nagisa Mitsuki က သရုပ်ဆောင်ထားတာဖြစ်ပြီး သရုပ်ဆောင်ကောင်းမကောင်းကတော့ ပရိတ်သတ်ကြီးပဲ ရှုစားကြပါခင်ဗျား။
crd cm"
},
{
"title":"[18+] Deadly Pickup (2016)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/06/MV5BNDk3YjVmNTctOGFkYi00OGFjLTk2YTEtNjQzNjIwN2U5Mjg1XkEyXkFqcGdeQXVyMTE2NDk2OTY@._V1_.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/06/hh5dke9-512x301.png",
"cate":"18+",
"runtime":"1hr 21min",
"links":[
{"type":"HD 700MB", "link":"https://megaup.net/2TEyr/Deadly.Pickup.2016.1080p.WEBRip.x264-RARBG.mkv"}
],
"review":"နာမည်လေးက လေပြေ…
နာမည် လေးက နူးညံ့သယောင်ယောင်ထင်ရပေမဲ့ မုန်တိုင်းထက် ကြမ်းတမ်းပြီး
ပင်လယ်ကြီးထက် မာယာများတယ်…
သူရဲ့ မာယာကျော့ကွင်းထဲက လွတ်သွားတဲ့ သားကောင်းဆိုတာ မရှိသလောက်ပါပဲ…
ဘယ်ရုန်းနိုင်မှာလဲ သူမရဲ့ အလှအပတွေက ငါးပါးအာရုံကို လှုပ်နှိုးစေတယ်လေ
သူမရဲ့ အပြုံး သူမရဲ့ အချိုးအစား ငြင်းရက်စရာတကွက်မှမရှိဘူးလေ ဒီကြားထဲ တော်ကီ အပြင်းစားတွေနဲ့ ပစ်ပေါက်တယ်လေ…
ထပ်ပြောရင် ပိုတယ်ထင်မှာစိုးလို့ လိုရင်းဇာတ်ကြောင်းလေးပဲ ဖေါ်ပြပါမယ်…
ဟိုက်ဝေးလမ်းမပေါ်မှာသူမက တစ်ယောက်တည်းလျှောက်လိမ့်နေတက်ပါတယ်..
သူမက အဆိပ် ပိုင်းမှာ သူမတူအောင်ကျွမ်းကျင်လှသူပါ
သူမရဲ့ နောက်ကအလှကို မခံမရပ်နိုင်ဖြစ်ပြီး ကားရပ်ပြီး တင်လိုက်မိရင်တော့ တင်တဲ့သူမဟာအမှားကြီးလုပ်မိတာပါပဲ….
အဲဒီသူ အသေဆိုးနဲ့ သေရတာပါပဲ ဒါပေမဲ့ သူမမှာ စည်းတစ်ခုတော့ရှိတယ်….
သူအားရအောင် ပျော်ပြီးမှပဲ ကိစ္စတုံးပစ်တာပါပဲ…
ဒီလိုနဲ့ သူမ မြို့ငယ်လေးတစ်ခုမှာ ကျင်လည်မိတယ်…
သူမအတွက်နေစရာ အခက်ခဲရှိနေတော့ ကျောင်းသူယောင်ဆောင်ပြီး လူဖြူနဲ့ လူမဲ တို့ရဲ့ အိမ်လေးမှာ အငှားနေပြီး သူမရဲ့အလုပ်ကိုဆက်လုပ်ပါတော့တယ်…
သူမအလုပ်က ရက်စက်လွန်းရာကျပြီး လူမဆန်တဲ့ အလုပ်မျိုးပါပဲ …
သူမရဲ့ ကျော့ကွင်းထဲ ကို ဘယ်သူတွေ ဘယ်လိုမိမလဲ ဘယ်သူတွေဘယ်လိုရအောင်ရုန်းမလဲ ဆိုတာတော့ အကဲခပ်ကြည့်ကြပါဦး…
(ပိုးစိုးပက်စက် မာယာများလွန်းတာကြောင့် ၁၈ နှစ်အောက် ချာတိတ်လေးများ မကြည့်သင့်ကြောင်း သတိချပ်ပါရစေ)။
crd cm
"
},
{
"title":"[21+] Holy Mother, Please Nana Ayano",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/06/60xvsr00060pl.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/06/nana_ayano_by_efabo_dd4vbvl-pre-341x512.jpg",
"cate":"japan,21+",
"runtime":"2hr 3min",
"links":[
{"type":"SD 600MB", "link":"https://megaup.net/4OB7y/(DS)Holy_Mother,Please[XVSR-060]_480p.mp4"},
{"type":"HD 1GB", "link":"https://megaup.net/3sGd0/(DS)Holy_Mother,Please[XVSR-060].mp4"},
{"type":"HD 1GB", "link":"https://upstream.to/dy2z19wi2e9p"}
],
"review":"Presented by Dark Side Production
Ayano Nana is a Nun in Japan. She is very kind and genuine, somewhat naive, but she also has some self-admitted dark feelings in her heart. On top of that, she is very well looking. And everyone around her notices that fact.When people in distress come seeking for help, she is always eager to offer help and a solution. Such a solution always involve the dude shooting their load, regardless of the problem. But hey, It always works wonderfully.The first scene has a little bit of an absurd touch. Like when the dude takes out of nowhere a huge bottle of baby-oil and offers it to Ayano. But it was so hilarious and it plays perfectly.All the other scenes have some juice too and they are good.Ayano Nana is awesome and the queen of quirky. She is so funny and has a body to die for. I can’t be the only one who misses her greatly. But by now I don’t really expect her to make a comeback.
crd cm"
},
{
"title":"[18+] How Much Do You Love Me? (2005)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/05/10614ace87ffe7142a81666de3b5b58d.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/05/10954909_1023534544326621_629422389_o-512x288.jpg",
"cate":"France,18+",
"runtime":"1hr 35min",
"links":[
{"type":"HD 999MB", "link":"https://megaup.net/T9fv/How_Much_Do_You_Love_Me_(Combien_Tu_M_aimes)_[18+]_[2005]_(MM_Sub).mp4"},
{"type":"HD 999MB", "link":"https://upstream.to/th5yh5jkdh8g"}
],
"review":"ပုရိသအပေါင်းတို့ အကြိမ်ကြိမ်ကြွေခဲ့ရသော Malena ဇာတ်ကားထဲက မမကြီး Monica Bellucci ကို အမှတ်ရကြဦးမလား….ဒီဇာတ်ကားမှာလဲ မမကြီးဟာ ကျွန်တော်တို့ကို အကြိမ်ကြိမ်ထပ်ခြွေဦးမှပြါ…သိဘို့။မမရဲ့ဖြစ်တည်မှုတွေက ပြင်းရှတဲ့ နှစ်ချို့ဝိုင်တစ်ခွက်လို …။ဇာတ်လမ်းကိုသွားရမယ်ဆိုရင်တော့ဖြင့်….ဖရန်ဆွာ့ဇ်ဟာ ဟာ အထီးကျန်ဘဝနဲ့ သူ့ရဲ့ ပျင်းရိစရာ ရုပ်အလုပ်တို့ကို ငြီးငွေ့နေတဲ့ ပြင်သစ်သားတစ်ယောက်ဖြစ်ပါတယ်။ တစ်နေ့မှာတော့ ဘားတစ်ခုကိုသွားရင်း လှပတဲ့ မိန်းမပျက်ကလေးတစ်ဦးဖြစ်တဲ့ ဒင်နီယယ်လာ နဲ့ ဆုံခဲ့တယ်။ မြင်မြင်ချင်း
ဒင်နီယယ်လာကိုစွဲလန်းမိရင်းက သူဟာ မီလျံချီ ထီပေါက်ထားတဲ့သူဖြစ်ကြောင်း နဲ့ သူနဲ့ အတူနေမယ်ဆိုရင် တစ်လကို ယူရို ၁၀၀.၀၀၀
ငွေမကုန်မချင်းပေးမယ်လို့ ကမ်းလှမ်းလာတဲ့အခါ ဒင်နီယယ်လာကလဲ သဘောတူခဲ့တယ်။သဘောမတူနိုင်တာကတော့ သူ့ သူငယ်ချင်းလဲဖြစ် သူ့ ဆရာဝန်လဲဖြစ်တဲ့ အန်ဒရေးပါ။ အန်ဒရေးက ဖရန်ဆွာ့ဇ်ရဲ့ နှလုံးအားနည်းရောဂါဟာ ဒီလိုလိင်မှု ကိစ္စတက်ကြွပုံမျိုးနဲ့ သင့်တော်မှာ မဟုတ်ဘူးလို့ သတိပေးပါတယ်။ စားသောက်ဆိုင်မှာ ညစာစားကြရင်း ဒင်နီယယ်လာ အစာအဆိပ်သင့်သလိုဖြစ်တော့ အန်ဒရေးကို လှမ်းခေါ်ခဲ့တယ်။ အခန်းထဲမှာ နှစ်ယောက်တည်း
စမ်းသပ်နေရင်း ဒင်နီယယ်လာက အဝတ်အစားချွတ်ပေးရမလားလို့မေးတယ်။ သူက မလိုအပ်ကြောင်းပြောပေမယ့် ဒင်နီယယ်လာက
ဇွတ်အဝတ်အစားချွတ်လိုက်ချိန်မှာတော့ ရင်ဖိုလှိုက်မောစရာကောင်းလောက်အောင်လှပတဲ့ သူ့ခန္ဓာကိုယ်ကောက်ကြောင်းရဲ့ဆွဲဆောင်မှုကို မခံနိုင်တော့ပဲ..။လူရိုးလူအေးကြီး တစ်ယောက်ဖြစ်တဲ့ ဖရန်ဆွာ့ဇ်ရဲ့ ဘဝကို ဒင်နီယယ်လာ တစ်ယောက် ဘယ်လိုကမောက်ကမ ကျွမ်းထိုးမှောက်ခုံတွေဖြစ်အောင် မွှေနှောက်မလဲဆိုတာ ဆက်လက်ရှုစားကြပါ။
ဒင်နီယယ်လာ အဖြစ် သရုပ်ဆောင်ထားတဲ့ ကမ္ဘာအလှဆုံး အမျိုးသမီးစာရင်းအကြိမ်ကြိမ်ဝင်ခဲ့တဲ့ မမကြီး Monica Bellucci ရဲ့
မိမွေးတိုင်း ဖမွေးတိုင်း အလှအပတွေနဲ့ကြည့်လို့တန်စေမှာပါ။(ဘာသာပြန်တင်ဆက်ထားသူကတော့ Alias ဖြစ်ပါတယ်။)
crd cm"
},
{
"title":"[21+] Tropical Night – Meguri [MEYD-245]",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/05/AAQ58ddbd5de544a.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/05/CoyRk3CUkAEMQZT-512x512.jpg",
"cate":"Japan,21+",
"runtime":"1hr 58min",
"links":[
{"type":"HD 99MB", "link":"https://megaup.net/TY81/Tropical_Night_%E2%80%93_Meguri_%7BMEYD-245%7D_[21+]_(MM_Sub).mp4"},
{"type":"HD 99MB", "link":"https://upstream.to/z35rt4iev9vd"}
],
"review":"Dark Side Production
Meguri is a married lady living with her husband and Father-in-law, however, her husband cheats on her and so she has been increasingly dissatisfied and frustrated. Then one day, suddenly, the Brother of her husband returns to the family home from Tokyo, he has lost his job and he has his own set of frustrations, even more, she gets pressured by the family to find a job.One day, Meguri has a very sudden gesture of kindness towards the Brother, who either completely misunderstood Meguri, or couldn’t handle his blue balls anymore, but either case he jumped on Meguri, who quickly gains affection for this Brother who shares her loneliness and misfortunes.
Gotta say the director did fantastic work for this video, the camera angles and presentation is just perfect. The plot is simple but executed really well in a very serious approach, and the sweat scenes are just awesome.
And what to say about Meguri? She’s so damn sexy while sweating buckets… The shower scene was great and the following one too. In fact some of the best I have seen in quite a long while.
crd cm"
},
{
"title":"[18+] Two Moon Junction (1988)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/04/two-moon-junction-poster.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/04/two-moon-junction.jpg",
"cate":"18+",
"runtime":"1hr 40min",
"links":[
{"type":"HD 900MB", "link":"https://megaup.net/Ty0m/Two_Moon_Junction_[18+]_[1988]_(MM_Sub).mp4"},
{"type":"HD 900MB", "link":"https://upstream.to/f2k0au3wbxj3"}
],
"review":"တောင်ပိုင်းရဲ့ ဂုဏ်ရှိန်ကြီးပါတဲ့ မိသားစုတစ်ခုက Aprilဆိုတဲ့ မိန်းကလေးတစ်ယောက်ရဲ့ဘဝအချိုးအကွေ့ကတော့ ဘွဲ့ရပြီး မကြာခင် ဆောင်တော့မယ့် သူ့မင်္ဂလာဆောင်ရက်ကလေး မတိုင်ခင်မှာ ပေါ်ပေါက်လာပါတယ်။
အကြောင်းကတော့ ထရပ်ကားတစ်စီးပေါ်မှာ ခွေးတစ်ကောင်နဲ့ပဲ အမြဲအတူရှိနေတတ်တဲ့ လေလွင့်လူတစ်ယောက် သူ့ဘဝထဲဝင်လာခြင်းပါပဲ။
ဆရာကြီးပီမိုးနင်း မိန်းမစိတ်ကျမ်းထဲထည့်ရေးဖူးသလို မိန်းမစိတ်ဟာ ဆန်းပါတယ်။သူုပြခဲ့တဲ့ ဥပမာဆိုရင်တော့.. မိန်းမတစ်ယောက်ဟာ ပုံပျက်ပန်းပျက်ရုပ်ဆိုးပြီး ဗလကောင်းနေတဲ့လူတစ်ယောက်ကို လှမ်းအမြင်မှာ အလိုလိုချစ်သွားပြီး အနီးကပ်မှ သူ့ယောကျာ်းမျက်နှာဒဏ်ရာရလာတာမှန်း သိရတော့ စိတ်မပါတော့တာမျိုုးပါ။ အရာရာရွှေအတိကျပြီးခဲ့တဲ့အနာဂတ်ရယ် ဆန္ဒအလိုလိုက်မှုတွေရယ် ကြားမှာ ဂုဏ်သရေရှိပညာတတ်Aprilဆိုတဲ့ကောင်မလေးတစ်ယောက် ကလေကချေ အရိုင်းအစိုင်းတစ်ကောင်ကိုဆက်ဆံတဲ့ပုံတွေကတော့ တကယ့်ကို နားလည်ရခက်ခက်ပါပဲ။ မိန်းမဆိုတဲ့ ကျမ်းကြီးကိုလူအတော်များများကတော့ အနှေးနဲ့အမြန်လေ့လာရမှာပါပဲ…ဒီဇာတ်လမ်းကတော့ နားလည်ရခက်မယ့်မိန်းမစိတ်အကြောင်းလေ့လာရာမှာ တစ်ထောင့်တစ်နေရာက အထောက်အကူုဖြစ်စေမှာပါ ထုံးစံအတိုင်း ပညာယူရင်းမင်းသမီးချောလေး SHEIRLYN FENNရဲ့  တစ်ကြောင်းမျဉ်းအလှတရားပေါင်းများစွာကို တဝကြီးတွေ့ရမှာပါ…  
၁၈+အခန်းပေါင်းများစွာပါသဖြင့် မိသားစုနှင့်အတူမကြည့်သင့်ပါ….
crd cm"
},
{
"title":"[18+] New Folder (2014)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/03/new-folder-poster.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/03/new-folder-362x512.jpg",
"cate":"Korea,18+",
"runtime":"1hr 24min",
"links":[
{"type":"HD 700MB", "link":"https://megaup.net/Ueo3/New_Folder_(Saepoldeo)_[18+]_[2014]_(MM_Sub).mp4"},
{"type":"HD 700MB", "link":"https://upstream.to/iu3zkd8e954c"}
],
"review":"ကိုရီးယားသမရိုးကျ ၁၈+ ဇာတ်အိမ်တွေကနေဖောက်ထွက်ပြီနှစ်ထောင်းအားရစရာ ကားကောင်းလေးတင်ဆက်လိုက်ပါတယ်။မိန်းကလေးတွေရဲ့ ယောကျာၤးလေးတစ်ယောက်အပေါ်မှာ ပိုက်ဆံပြီးရင် ဘာကအရေးအကြီးဆုံးဆိုတာကိုကွက်ကွက်ကွင်းကွင်း မီးမောင်းထိုးပြထားတဲ့ကားလေးပါ….ဖက်တီး တစ်ယောက် အစား နဲ့ မိန်းမကိုမြင်ရင် ဘယ်လိုမှမနေနိုင်တဲ့ တစ်ယောက်ဖြစ်နေပါတယ်
ဆိုးတာက သူ့ရဲ့ အစားကြူးမှု့က သူ့ကို ဖက်တီးတစ်ယောက်ဖြစ်လာစေပြီး လုပ်သမျှ အလွဲလွဲအချော်ချော် ဖြစ်နေစေပါတယ်
မိန်းကလေးတစ်ယောက်ကို မြင်ရင် ဒါမှမဟုတ်သူ့ဘေးက ဖြတ်သွားရင်တောင် ဗို့အား သောင်းတစ်ထောင်မျက်လုံးနဲ့ ခြေဆုံးခေါင်းဆုံးလိုက်ကြည့်ပါတယ်…သူကမိန်းမလိုချင်လွန်းလို့ ကြင်ရာဖက် တွေလိုက်ရှာပြီးတွေ့တွေ့နေတာကလည်း အမောပါပဲ…သူနဲ့တွေ့တဲ့မိန်းကလေးတွေကလည်း မထိရက်စရာ ကပိုကယိုအလှလေးတွေနဲ့ ဖြစ်နေတော့သူ့ခမျာ အခက်တွေ့နေပါတယ်သူ့ကိုလည်းကြည့်လေ လူကဖက်တီး မိန်းကလေးတစ်ယောက်ကိုကြည့်ရင် မကြည့်သင့်တာတွေကိုပဲ စိုက်ကြည့်နေတော့…မိန်းကလေးတွေက မခံမရပ်နိုင်အောင်ဒေါသတွေထွက်ပြီး ထွက်ပြေးကြတာချည်းပဲ။တစ်နေ့မှာ ဆိုင်မှာအလုပ်လုပ်ရင်း ရည်းစားနဲ့ပြတ်ပြီး စိတ်လေနေတဲ့ ကောင်မလေးတစ်ယောက်ကို မြင်မြင်ချင်းပဲ ချစ်မိသွားခဲ့ပါတယ်…သူက ချစ်ခွင့်ပန်တော့ ကောင်မလေးက “ရှင့်လိုဖက်တီးမျိုး ရွံတယ်” ဆိုပြီး ပြစ်ပြစ်ခါခါပြောပြီးငြင်းလိုက်ပါတယ်…သူလည်းစိတ်ပျက်ပျက်နဲ့ လမ်းဖြတ်ကူးလိုက်တယ်ဆိုရင်ပဲ ကားတစ်စီးဝင်တိုက်တာခံရပြီးတော့ မျက်နှာတစ်ခုလုံးစုတ်ပြတ်သတ်သွားခဲ့ပါတယ်….သူ ဆေးရုံမှာ သုံးလကြာဆေးကုသမှုခံပြီးတဲ့အခါမှာတော့ ဒေးဗစ်ကော်ပါဖီး မျက်လှည့်ပြလိုက်သလို သူ့ပုံသဏ္ဍန်တွေကပြောင်းလဲကုန်ပြီး အမေကတောင်မမှတ်မိဖြစ်သွားပါပြီ…အလား…..အဲဒီမှာစတာပဲ သူ အတွေ့အကြုံယူမယ်ဆိုပြီး ပါတီတစ်ခုကိုရောက်သွားပါတယ်သူ့သူငယ်ချင်းကောင်းမှု့နဲ့ပဲ သူ့ပထမဆုံးအတွေ့ကြုံကို အရမ်းနန်းဆန်ပြီး နာမည်ချက်ချင်းရိုက်ရှာချင်လောက်အောင်(ဂူးဂဲလ် မှာ)လှပတဲ့အနောက်တိုင်းသူလေးနဲ့ စခွင့်ရခဲ့ပါတော့တယ်….။အဲဒီနောက်မှာတော့ သူနဲ့ဒိတ်ပြီး သူ့ကိုပြစ်ပြစ်ခါခါ ပြောဆိုသွားတဲ့ နတ်မိမယ်လေးတွေကို အပီအပြင် ဖြုတ်ပါတော့တယ်……လှပတဲ့ ကလဲ့စားလေးပေါ့ဗျာ….နတ်မိမယ်လေးတွေကို ဘယ်လိုချုပ်ပြီး ဘယ်လိုဖြုတ်မလဲဆိုတာကိုတော့ ဒေါင်းသာကြည့်တော့ဗျာ….။(စာကြွင်း။ ။ ဂျင်းကားမဟုတ်ပါ။ အကြိုက်ချင်းတူရင်စစ်ခင်းကုန်ကြမှာပေါ့ဗျာ။)(ကိမုချိမှတင်ဆက်ပေးထားပါတယ်)
crd cm"
},
{
"title":"[18+] Killing Me Softly (2002)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/03/MV5BMTUwNzc5ODQxN15BMl5BanBnXkFtZTYwNTc4NDk5._V1_.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/03/MV5BYjRkYmQ1ZTctOWI4ZC00NDc3LWJkYzEtNjY0N2UwOWE2OTA4XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_-354x512.jpg",
"cate":"18+",
"runtime":"1hr 40min",
"links":[
{"type":"HD 900MB", "link":"https://megaup.net/2gt9v/Killing_Me_Softly_[18+]_[2002]_(MM_Sub).mp4"},
{"type":"HD 900MB", "link":"https://upstream.to/y4mtt9tsoifi"}
],
"review":"Alice လို မိန်းမလှလေးအနေနဲ့ ဒီလိုလူတစ်ယောက်နဲ့ပဲ အတူနေပြီး ဘဝကိုအတူနေထိုင် ချစ်တင်းနှီးနှော နောက်နေ့အလုပ်သွား အဲလိုမျို းနဲ့ ဘဝဟာ အဓိပ္ပါယ်ရှိလောက်ပြီလို့ ရည်ရွယ်ရင်းရှိပုံပါ။ လက်ရှိအတူနေရည်းစားက ခပ်အေးအေး လိင်မှု ကိစ္စမှာလည်း သမားရိုးကျဆိုတာထက် အလုပ်တစ်ခုလို အိပ်ယာပေါ်တက်ချိန်လောက်ပဲ ချစ်ဗျူ ဟာခင်း အိပ်မောကျမယ်။နောက်နေ့သူလိုအလုပ်သွားမယ်။ဆိုရရင်စာအုပ်ကြီးသမားပုံစံပေါ့။Alice လိုချင်တဲ့ယောကျ်ားသားမျို းက မရိုးနိုင်တဲ့ ချစ်တင်းနှီးနှောဖလှယ်မှုတွေနဲ့ စိတ်လှုပ်ရှားမှု အပြည့်ပေးစွမ်းနိုင်တဲ့ သူမစိတ်ခန္ဓာတစ်ခုလုံး သိမ်းကျုံ းမျောပါးသွားစေလောက်တဲ့အထိ ဆွဲဆောင်မှု အတတ်ပညာပြည့်ဝတဲ့ ယောကျ်ားသားတစ်ယောက်ကို စိတ်ကူးယဉ်တမ်းတနေသလားတော့မသိဘူး။လက်ရှိနေထိုင်မှု အပေါ်ကိုတော့ ငြီးငွေ့စပြုနေတာ သေချာပါတယ်။
ပြောလို့သာပြောရတာ အထက်ကဆိုခဲ့တဲ့ ချစ်ဗျူ ဟာခင်းတာလည်းကျွမ်းကျင် ရုပ်ရည်ကလည်းဆွဲဆောင်မှုအပြည့် ယောကျ်ားပီသလှတဲ့ ပုရိသမျို းဆိုတာကလည်း ခပ်ပေါပေါအချစ်ဖန်စီစာအုပ်တွေနဲ့အပြာစာအုပ်တွေထဲလောက်ပဲတွေ့နိုင်တာမဟုတ်လား။ဒါပေမယ့် Aliceမှာ မထင်မှတ်ဘဲ စိတ်လှုပ်ရှားမှု အပြည့်တွေနဲ့ပဉ္စလက်ဆန်လှတဲ့ဘဝနေထိုင်မှုတွေရှိနေတဲ့ Adam ဆိုတဲ့ ယောကျ်ားပျို တစ်ယောက်နဲ့ ဆုံဆည်းဖို့ကံကြုံ လာရတော့တယ်။သူ့ရဲ့အကြည့်တွေဟာ Alice တစ်ကိုယ်လုံးက အသွေးအသားတွေထွက်ကျ ဆွဲပါသွားသလိုမျိုး ဖြစ်အောင်ပဲ ညှို့အားပြင်းထန်လွန်းလှတယ်။Aliceမှာ စတွေ့တဲ့နေ့က ဘတ်စကားမှတ်တိုင်နားမှာ အလုပ်လည်းမလုပ်နိုင်။သူ့အကြောင်းတွေးပြီး အမှားမှားအယွင်းယွင်းတွေဖြစ်နေရတယ်။တရုတ်ကပ်ကလေးကို ခဏခဏလှပ်ပြီး လမ်းပေါ်မှာ သူရှိနေသလား ချောင်းကြည့်မိတာလည်း အကြိမ်ကြိမ်။တကယ်တော့ Adamဖြစ်သူကလည်း တနေ့တာလုံး သူမရုံးဆင်းချိန်ရောက်တဲ့ တိုင်အောင် စာင့်ဆိုင်းနေတာပဲလေ။
သူတို့ဆီက အချစ်ရဲ့အဓိပ္ပါယ်ပုံဖော်မှုက ကိုယ်တွေဆီကလို မိဘအရိပ်မှာနေရတာမို့။ဘယ်လိုစံနဲ့မှ ကိုယ်လက်နှီးနှောမှုကို ခွင့်ပြု တာတို့။သုံးနှစ်သုံးမိုးပြည့်ပြီး မင်္ဂလာဦးညမှ အပျို စင်ဘဝကို စွန့်လွှတ်မယ်တွေ ဘာတွေမှ မရှိတာဘဲ။One Nightstand ဆိုတာ ညကလပ်ထဲမှာတင် တွေ့တဲ့တယောက်ယောက်နဲ့ အိပ်ချင်အိပ်လိုက်တာပဲ မဟုတ်လား။သမားရိုးကျ လိင်မှု ဘဝမှာ ငြီးငွေ့ရင်းစွဲရှိတဲ့ Alice ဟာ Adamနဲ့ တွေ့တွေ့ချင်းမှာပဲ သူ့ရဲ့ပြင်းထန်ကြမ်းတမ်းလွန်းတဲ့ သူမခန္ဓာအပေါ် တပ်မက်လွန်းအားကြီးပုံပေါက်နေတဲ့ ချစ်တင်းနှီးနှောမှုအောက်မှာ စွဲဝင်ပြီး နက်နက်ရှို င်းရှိုင်း စွဲလန်းသွားတော့တယ်။အိမ်ပြန်လိုက်ချိန်မှာတော့ အိမ်ကစာအုပ်ကြီးနဲ့ လိင်မှု ဖလှယ်ရမှု အပေါ်မှာ စိတ်ကမထကြွတော့တာ Alice အနေနဲ့ စိတ်မကောင်းဖြစ်မိရတယ်။ဒါကလည်း သူမရဲ့တကိုယ်ရည်စိတ်ပိုင်းဆိုင်ရာရဲ့ နှစ်သက်သဘောကျရာအလိုက် နှစ်သက်ခံစားပိုင်ခွင့်ရှိသွားတာ အပြစ်မှမဟုတ်တာဘဲလေ။Aliceသဘောကျတဲ့ အချစ်သင်္ကေတက Adamလို ပြင်းပြတဲ့အချစ်တွေမျို းပဲ ဖြစ်နေတာကို။ဒါပေမယ့် လိင်ရမ္မက်တစ်ခုနဲ့တင် သူတို့အချစ်ရေးလမ်းကြောင်းဟာ ထာဝရအဆင်ပြေချောမွေ့မယ်လို့ ထင်ပါသလား။Aliceဟာ Adamရဲ့ ရှု ပ်ထွေးခဲ့ပုံရတဲ့ အတိတ်တွေကို ဖြည်းညှင်းစွာသိရှိလာခဲ့တယ်။အဲဒီထဲမှာခုလို လိင်ရမ္မက်ပြသာနာတွေနဲ့ သေဆုံးသွားတဲ့မိန်းမတစ်ယောက်အကြောင်းလည်းပါလာတယ်။ထိုအခါမှာ Adamအပေါ်ထိတ်လန့်လာတော့တယ်။
crd cm"
},
{
"title":"[21+] Teacher Yua Mikami [SSNI-152]",
"poster":"https://channelmyanmar.org/wp-content/uploads/2019/02/11111-1.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2019/02/159640_10353113032018_Mikami-Yua-512x512.jpg",
"cate":"21+,Japan,",
"runtime":"3 hr 39min",
"links":[
{"type":"HD 1.3GB", "link":"https://megaup.net/1zVz4/Teacher_Yua_Mikami_(SSNI-152)_[21+]_(MM_Sub).mp4"},
{"type":"HD 1.3GB", "link":"https://upstream.to/v1sntpnm96jj"}
],
"review":"Yua Mikami rocks, accept it or GTFO
Seems Mikami Yua Idol plans dropped like a bomb in the worldwide webs (Instagram), she borderline got bullied by some K-pop retards. That is the normal daily everyday internet. But I feel sad because, there’s no way Yua didn’t notice this, because even her Idol group debut, Honey pop-corn, got delayed or canceled(?).That is really sad and plain wrong, Yua Mikami is really talented, sweet and her dream is to be an Idol. Let her be. She does porn and so what? big whoop.Yua is simply one of the best, the current best JAV actress award winner, and the quality of her adult videos has always been really high. A true gift for all us JAV fans.In this SSNI-152, she takes on the role of a female teacher, which partakes on a gangbang. Not long ago we had  SSNI-126 with RION, and I bashed on RION for the shitty acting job she did on that release. Compare that with Yua Mikami now, the gimmick is exactly the same. But Yua Mikami completely destroys RION. SSNI-152 is miles better, simply thanks to Yua.Even the male actors are really good here. Starting with that dude from the demon boys who always plays the Shotacon roles.Awesome release, anything Yua touches becomes gold.
crd cm"
},
{
"title":"MIAA 171 (mmsub)(Eimi Fukada)",
"poster":"https://1.bp.blogspot.com/-vMVhmxYmM2M/X-gxAW4EXnI/AAAAAAAAAPI/rISkanFalmAqagi5W6gkz-Yfd-pOiCynwCLcBGAsYHQ/s215/received_10873844150359.jpeg",
"cover":"https://1.bp.blogspot.com/-OeMLM8QtOqQ/X-DkE1amdFI/AAAAAAAACVE/GWwypduWKDsaK4MmnmwS4S34IiSbDtwXwCLcBGAsYHQ/s800/received_1087384415035994.jpeg",
"cate":"Japan,21+",
"runtime":"120 min",
"links":[
{"type":"HD 1.93GB", "link":"https://www.mediafire.com/file/zy34vw4l2tl85j9/MiAA-171%2528zoedi%2529.m4v/file"},
{"type":"HD 1.93GB", "link":"https://awscc3001.r18.com/litevideo/freepv/m/mia/miaa00171/miaa00171_sm_w.mp4"}
],
"review":"ဒီတခါလည်း zoedi က Eimi Fukadaရဲ့ MiAA-171ကားကိုတင်ဆက်ထားပေးပါတယ်။ ရည်းစားထားပြီး အလုပ်များနေတဲ့ သူဌေးကသူ့ သူငယ်ချင်း စာရေးစရာ တယောက်ကို အိမ် အလည်ခေါ်ခဲ့ပါတယ် ။ စာရေးဆရာ လည်းဖြစ် တဲ့ သူ့ သူငယ်ချင်း ကလည်း သူဌေးပေါက်စရဲ့ ကောင်မလေး ကို သဘောကျ မိတော့တာပဲ ။FA တယောက်အနေ နဲ့ အားကျ တဲ့ အပြင် သူ့ရဲ့ရှေ့မှာ Romantic ဆန်နေတဲ့ အတွဲ ကို စာရေးတဲ့ အတွေ့ အကြုံစုံ နေတော့ စာရေးတဲ့ ပညာအပြင်ဘယ်လိုပညာတွေထုတ်သုံးသွား မလဲ ကောင်မလေးက ကော Boyfriend ရှိရက်နဲ့ မသိစိတ်က လိုချင်တဲ့ အရာတွေ ဘယ်လို ပွင့်ထွက်လာမလဲ ဆို တာ ကြည့် လိုက်ကြရအောင်ဗျာ။ (ဘာသာပြန်သူစကား ကျနော် zoedi က Eimi Fan ဆိုတော့ သူ့ကားထဲမှာ မှ ကြိုက်မိတဲ့ ကားကို ဘာသာပြန် ကြည့်ရင်းနဲ့ တင်ပေးတာပါ ဒီကားဆို စာဖိုင်မစုံပါဘူး ဒါပေမယ့် အတတ်နိုင်ဆုံး ကြိုးစား ထားပေးပါတယ်။ တချို့နေရာလေးတွေမှာ စာတန်း မထိုးထားတာလေးတွေကို နားလည်ပေးစေချင်ပါတယ်။ Eimi ကားထဲမှာ ကျနော် ကြိုက်မိတဲ့ ကားတွေကလည်း စာဖိုင် အဆင် မ‌ပြေတာများတဲ့ အတွက် ဘာသာပြန်ဖြစ်ဦးမယ် မထင်ဘူးဗျာ ။ဝါသနာ အရသာ လုပ်နေတာ အလုပ်က မအားတာလည်းပါတာပေါ့။ အရင်2ကားဖြစ်တဲ့‌ MiAA-122နဲ့ PRED-159ကို အားပေးခဲ့တာလည်း ကျေးဇူးတင်နေမှာပါ။) Runtime:120min. (HD: 120min.) Director:Akihideto Studio:MOODYZ Content ID:miaa00171 Actress(es):Eimi Fukada Video Size : 1.9GB Translated & Encoded by Zoedi
Release Date:Oct 16 2019
crd darktv"
},
{
"title":"[18+] Love Conquest (2020)",
"poster":"https://image.tmdb.org/t/p/w185/ueFoWf7jGMY6HHMPyvw65vuuFLR.jpg",
"cover":"https://image.tmdb.org/t/p/w300/44Od2WMeEXnGIGlzq5PNK6nJXAA.jpg",
"cate":"korea,18+",
"runtime":"",
"links":[
{"type":"HD 720MB", "link":"https://megaup.net/2ge8u/(DS)_Love_Conquest.2020.720p.mp4"},
{"type":"FHD 1.35GB", "link":"https://megaup.net/Ujdh/(DS)_Love_Conquest.2020.FHD.1080p-NonDRM.mp4"}
],
"review":"Love Conquest 2020 (18+)အချစ်ဟာသကားကြိုက်တဲ့သူတွေအတွက်အချစ်ခန်းတွေလည်းကြည့်ရ ရီလည်းရီရမယ့် ဇာတ်ကားလေးလာပါပြီ။ဇာတ်လမ်းကတော့ အချစ်ရေးမှာအမြဲရှုံးနေရတဲ့ဒုန်းဆော့ဆိုသူကသူအချိန်အတော်ကြာ တစ်ဖက်သတ်ချစ်ရတဲ့
ကောင်မလေး ဟီယွန်းကို ဖွင့်ပြောဖို့ကြိုးစားရာကနေ
ကောင်မလေးကတခြား လက်မြန်တဲ့သူနောက်ပါသွားခဲ့ရာက စပါတယ်။၅နှစ်ကျော်တစ်ဖက်သတ် ချစ်ရသူ တခြားသူနောက် ပါသွားပြီးစိတ်ဓါတ်ကျနေတဲ့ ဒုန်းဆောကကျောင်းနေဖက် စီနီယာဖြစ်သူ အလုပ်လက်မဲ့ ဆောင်းဖြောင်းဆိုတဲ့ လူနဲ့ ဆုံပြီးတဲ့ နောက်မှာသူကံကြမ္မာက ပြောင်းလဲဖို့ဖြစ်လာခဲ့ပါတယ်။ဆောင်းဖြောင်းရဲ့မိတ်ဆက်ပေးမှုနဲ့ Adventure Mဆိုတဲ့ရည်းစားရှာဖွေရေး အချစ်ရေး ဝန်ဆောင်မှု Websiteကို စာရင်းသွင်းလိုက်ရာကနေသူ ဘဝထဲကို မြိုယောင်းဆိုတဲ့ မိန်းမချောလေးတစ်ယောက်ကလည်းဝင်ရောက်လာပါတယ်။မြိုယောင်းနဲ့သူဘယ်လို ခရီးဆက်ကြမလဲ။အချစ်ဦး ဟီယွန်းနဲ့ကော ဆုံနိုင်ပါ့မလား။ဖုန်းထဲကနေ တစ်ဆင့် ညွှန်ကြားချက်တွေ ပေးနေတဲ့Adventure M ဆိုတဲ့ လမ်းညွှန်ပေးတဲ့သူကကော ဘယ်သူဖြစ်လာမလဲ။စိတ်ဝင်စားဖို့ကောင်းသလို ရီလည်းရီရတဲ့ 18+ကားလေးတစ်ကားပါ။အချစ်အတွက်ရှုံးနေတဲ့သူတွေ၊အသဲကွဲနေတဲ့သူတွေ ကြည့်ပြီးမိန်းကလေးတွေရဲ့ သဘောကိုနားလည်အောင်လေ့လာလို့ရပါတယ်။18+သီးသန့်မဟုတ်ပဲဇာတ်လမ်းသွားလေးနဲ့ Ro ဆန်ဆန် ကြည့်ချင်တယ်ဆိုရင်တော့
crd cm"
},
{
"title":"18+ Beauty Salon Special Service 4 (2020)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/11/gmv51zfflwb4.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/11/gmv51zfflwb4.jpg",
"cate":"Korea,18+",
"runtime":"",
"links":[
{"type":"HD 249MB", "link":"https://megaup.net/1zGnt/Beauty_Salon_Special_Service_4_720p_(2020)_%7BDS%7D.mp4"},
{"type":"FHD 669MB", "link":"https://megaup.net/1zGnn/Beauty_Salon_Special_Service_4_(2020)_%7BDS%7D.mp4"}
],
"review":"Special Service 4(2020) 18+
ဆိုဇာတ်လမ်းသွားနဲ့ အနုအရွခံစားချင်တယ်ဆိုတဲ့ ဘဒိုတွေအတွက် ကိုရီးယား 18+လေးလာပါပြီDarksite ကိုရီးယား အားပေးတဲ့ အမျိုးသားထုကြီးအတွက် ဒီတစ်ခါထူးထူးခြားခြား Service ပေးတဲ့ အလှပြင်ဆိုင်လေးနဲ့မိတ်ဆက်ပေးချင်ပါတယ်။Stay Home မှာဆံပင်တွေရှည်နေလို့ ညှပ်ချင်တယ်ဆိုတဲ့ ဘဒိုတွေ ဒီကားကြည့်ပြီး ဒီဆိုင်မှာပဲ ညှပ်ချင်တယ်ဖြစ်သွားစေရမယ်။ဇာတ်လမ်းကတော့ ပါလေရာကျော်ကြီးနဲ့ အပေါင်းအပါများရဲ့ ဆံပင်ညှပ်ဆိုင် အလှူပေးရေး ဇာတ်ကြောင်းလေးပေါ့။ဇာတ်လမ်းလေးက ဒီလိုစတယ်။ဧည့်သည်မကျ ဝင်ငွေမကောင်း ဆိုင်လခပေးဖို့အခက်ကြုံနေတဲ့ ဆံပင်ညှပ်ဆိုင်က လုံးကြီးပေါက်လှ သူဠေးမမနဲ့
လက်ထောက်ဂစ်တာရှိတ် ကောင်မလေးတို့က အကြံကုန်ဂဠုန်ဆားချက် အင်တာနက်မှာ ခေတ်စားနေတဲ့ အထူးအစီအစဉ်လေးတစ်ခု
လုပ်ပြီး ယောက်ျားလေးဖောက်သည်တွေကို ဆွဲဆောင်ဖို့ အစီအစဉ်စဆွဲပါတော့တယ်။သူရဲ့အထူးအစီအစဉ်ကဘာလဲ ဆိုတော့ ဆံပင်လာညှပ်တဲ့ ဘဲတွေကို ဘီကီနီလေးဝတ်ပြီးတော့ ဧည့်ခံကြိုဆိုမယ့်အပြင် After Serviceတွေပါ အပြည့်အဝပေးအုန်းမှာ။ကဲ ဘယ်လိုလဲဆံပင်ညှပ်ချင်သွားပြီမလား ငါးကောင်တို့။ကိုရီးယားကားဆို ဇာတ်လမ်းထက်ဆော်လေးတွေပဲစိတ်ဝင်စားတဲ့ ဘဒိုတွေအတွက် ကြည့်ရတာတန်အောင်ဆော် review လေးပေးခဲ့မယ်။ကိုရီးယားမတွေထုံးစံအတိုင်း ဖွေးအုနေတာတော့ ထုံးစံပဲ။သူဠေးမမက အသက်နည်းနည်းရပြီဆိုပေမယ့် ပေါက်စီကအတော်ကိတ်တယ်။ လုံးဝ Sလိုင်း။ပြီးတော့ ဆော်ကြီးကအတော်ထန်တယ်ပြောရမယ်။အငယ်လက်ထောက်မလေးကတော့ နုနုငယ်ငယ် ချွဲချွဲနွဲ့နွဲ့ အကဲပိုတယ်။ဉာဏ်လည်းများသလိုအပြုအစုလည်းကောင်းတယ်။သူလည်း ပေါက်စီက တော်တော်ကိတ်တယ်။လုံးဝအသန့်တစ်လိုင်း။ကဲ ဒီလောက်ဆို သိုင်းဆရာတို့အတွက်ရှယ်ဆိုတာ သိပ်ညွှန်းစရာမလိုတော့ဘူး။ကိုယ်တိုင်သာဒေါင်းကြည့်စေချင်တယ်။
crd cm"
},
{
"title":"[21+] My Girlfriend’s Older Sister,Misaki Honda [PPPD-531]",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/12/91yPC-t9VML._AC_SL1500_.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/12/pppd00531jp-9-768x514.jpg",
"cate":"Japan,uncensored,21+",
"runtime":"2 hr",
"links":[
{"type":"HD 1.2GB", "link":"https://upstream.to/1b705d0yzenu"},
{"type":"HD 1.2GB", "link":"https://megaup.net/1Aqyd/[DS][PPPD-531]_My_Girlfriend%E2%80%99s_Older_Sister,Misaki_Honda_720p.mp4"},
{"type":"FHD 2.5GB", "link":"https://megaup.net/Ut65/[DS][PPPD-531]_My_Girlfriend%E2%80%99s_Older_Sister,Misaki_Honda_1080p.mp4"}
],
"review":"Dark Side production မှ တင်ဆက်သည်။
ဒီဇာတ်ကားကို Decensored Version နဲ့တင်ထားတာမို့ ဆင်ဆာမပါသလိုမျိုးတွေ မြင်ရဖို့ရှိပါတဘ်။This dude has been dating her girlfriend Erina for the last 6 months and on a night out drinking, she gets smashing drunk.He has to carry her back home and once in the house, he meets for the first time with Erina’s older sister, Misaki Honda. And exceptionally voluptuous and horny sister that instantly likes him.He also likes her, because unlike the girlfriend, Sister Misaki Honda can’t be bothered about condoms…
crd cm"
},
{
"title":"[18+] Step Up Love Story (2011)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2018/02/224930876447995128_13608651_c.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2018/02/l3eut79sahqh.jpg",
"cate":"Japan,18+",
"runtime":"1 hr 13 min",
"links":[
{"type":"HD 800MB", "link":"https://megaup.net/Uep2/Step_Up_Love_Story_(Futari_Ecchi)_[18+]_[2011]_(MM_Sub).mp4"},
{"type":"HD 800MB", "link":"https://upstream.to/21bznib5xefo"}
],
"review":"ဇာတ်လမ်းကတော့….
အချစ်ကို အချစ်လို့သာသိပြီး အဘာကြီးဘာနေကြတဲ့ သူငယ်ချင်းတွေကြား ဘာအတွေ့အကြုံမှ မရှိသေးတဲ့ စုံတွဲလေးအကြောင်းကို သာသာယာယာလေး ပြသွားမယ့် ဇာတ်လမ်းလေးကို ချပြလတ်ပါပြီ…..
Living Together ခေတ်ကြီးမှာ… ခုတွေ့ ခုချစ် ခုယူ ဖြစ်သွားခဲ့တဲ့ မာကိုတိုတို့ စုံတွဲဟာ မီးဖိုချောင် ကိစ္စကအစ အိမ်ထောင်ရေး သုခအဆုံး နကန်းတစ်လုံးမှ မသိကြသေးပါဘူး…
ဒါကို ရိပ်မိကြတဲ့ အပေါင်းအသင်းတွေက သူတို့ရဲ့ အတွေ့အကြုံတွေနဲ့ သင်တန်းပို့ချပေးကြပါတယ်..ကောင်မလေးဖက်က သူငယ်ချင်းကလည်း ထိုနည်း၎င်း လမ်းပြကြတယ် ဆိုပါတော့…ကြားသမျှလေးတွေနဲ့ လက်တည့်စမ်းတဲ့ မာကိုတိုနဲ့ အကြံပေးတိုင်း လိုက်လုပ်ရှာတဲ့ သူ့ချစ်ဇနီးလေးတို့ အဆင်ပဲပြေကြမလား၊ အောင့်အီးသည်းခံတွေပဲ ဖြစ်မလား ဆိုတာကတော့ ကိုယ့်လူတို့ လက်တွေ့ဒေါင်းကြည့်လိုက်ကြတော့ဗျာ…။
crd cm"
}
]