[
{
"title":"MIAA 171 (mmsub)(Eimi Fukada)",
"poster":"https://1.bp.blogspot.com/-vMVhmxYmM2M/X-gxAW4EXnI/AAAAAAAAAPI/rISkanFalmAqagi5W6gkz-Yfd-pOiCynwCLcBGAsYHQ/s215/received_10873844150359.jpeg",
"cover":"https://1.bp.blogspot.com/-OeMLM8QtOqQ/X-DkE1amdFI/AAAAAAAACVE/GWwypduWKDsaK4MmnmwS4S34IiSbDtwXwCLcBGAsYHQ/s800/received_1087384415035994.jpeg",
"cate":"Japan,21+",
"runtime":"120 min",
"links":[
{"type":"HD 1.93GB", "link":"https://www.mediafire.com/file/zy34vw4l2tl85j9/MiAA-171%2528zoedi%2529.m4v/file"},
{"type":"HD 1.93GB", "link":"https://awscc3001.r18.com/litevideo/freepv/m/mia/miaa00171/miaa00171_sm_w.mp4"}
],
"review":"ဒီတခါလည်း zoedi က Eimi Fukadaရဲ့ MiAA-171ကားကိုတင်ဆက်ထားပေးပါတယ်။ ရည်းစားထားပြီး အလုပ်များနေတဲ့ သူဌေးကသူ့ သူငယ်ချင်း စာရေးစရာ တယောက်ကို အိမ် အလည်ခေါ်ခဲ့ပါတယ် ။ စာရေးဆရာ လည်းဖြစ် တဲ့ သူ့ သူငယ်ချင်း ကလည်း သူဌေးပေါက်စရဲ့ ကောင်မလေး ကို သဘောကျ မိတော့တာပဲ ။FA တယောက်အနေ နဲ့ အားကျ တဲ့ အပြင် သူ့ရဲ့ရှေ့မှာ Romantic ဆန်နေတဲ့ အတွဲ ကို စာရေးတဲ့ အတွေ့ အကြုံစုံ နေတော့ စာရေးတဲ့ ပညာအပြင်ဘယ်လိုပညာတွေထုတ်သုံးသွား မလဲ ကောင်မလေးက ကော Boyfriend ရှိရက်နဲ့ မသိစိတ်က လိုချင်တဲ့ အရာတွေ ဘယ်လို ပွင့်ထွက်လာမလဲ ဆို တာ ကြည့် လိုက်ကြရအောင်ဗျာ။ (ဘာသာပြန်သူစကား ကျနော် zoedi က Eimi Fan ဆိုတော့ သူ့ကားထဲမှာ မှ ကြိုက်မိတဲ့ ကားကို ဘာသာပြန် ကြည့်ရင်းနဲ့ တင်ပေးတာပါ ဒီကားဆို စာဖိုင်မစုံပါဘူး ဒါပေမယ့် အတတ်နိုင်ဆုံး ကြိုးစား ထားပေးပါတယ်။ တချို့နေရာလေးတွေမှာ စာတန်း မထိုးထားတာလေးတွေကို နားလည်ပေးစေချင်ပါတယ်။ Eimi ကားထဲမှာ ကျနော် ကြိုက်မိတဲ့ ကားတွေကလည်း စာဖိုင် အဆင် မ‌ပြေတာများတဲ့ အတွက် ဘာသာပြန်ဖြစ်ဦးမယ် မထင်ဘူးဗျာ ။ဝါသနာ အရသာ လုပ်နေတာ အလုပ်က မအားတာလည်းပါတာပေါ့။ အရင်2ကားဖြစ်တဲ့‌ MiAA-122နဲ့ PRED-159ကို အားပေးခဲ့တာလည်း ကျေးဇူးတင်နေမှာပါ။) Runtime:120min. (HD: 120min.) Director:Akihideto Studio:MOODYZ Content ID:miaa00171 Actress(es):Eimi Fukada Video Size : 1.9GB Translated & Encoded by Zoedi
Release Date:Oct 16 2019
crd darktv"
},
{
"title":"[18+] Love Conquest (2020)",
"poster":"https://image.tmdb.org/t/p/w185/ueFoWf7jGMY6HHMPyvw65vuuFLR.jpg",
"cover":"https://image.tmdb.org/t/p/w300/44Od2WMeEXnGIGlzq5PNK6nJXAA.jpg",
"cate":"korea,18+",
"runtime":"",
"links":[
{"type":"HD 720MB", "link":"https://megaup.net/2ge8u/(DS)_Love_Conquest.2020.720p.mp4"},
{"type":"FHD 1.35GB", "link":"https://megaup.net/Ujdh/(DS)_Love_Conquest.2020.FHD.1080p-NonDRM.mp4"}
],
"review":"Love Conquest 2020 (18+)အချစ်ဟာသကားကြိုက်တဲ့သူတွေအတွက်အချစ်ခန်းတွေလည်းကြည့်ရ ရီလည်းရီရမယ့် ဇာတ်ကားလေးလာပါပြီ။ဇာတ်လမ်းကတော့ အချစ်ရေးမှာအမြဲရှုံးနေရတဲ့ဒုန်းဆော့ဆိုသူကသူအချိန်အတော်ကြာ တစ်ဖက်သတ်ချစ်ရတဲ့
ကောင်မလေး ဟီယွန်းကို ဖွင့်ပြောဖို့ကြိုးစားရာကနေ
ကောင်မလေးကတခြား လက်မြန်တဲ့သူနောက်ပါသွားခဲ့ရာက စပါတယ်။၅နှစ်ကျော်တစ်ဖက်သတ် ချစ်ရသူ တခြားသူနောက် ပါသွားပြီးစိတ်ဓါတ်ကျနေတဲ့ ဒုန်းဆောကကျောင်းနေဖက် စီနီယာဖြစ်သူ အလုပ်လက်မဲ့ ဆောင်းဖြောင်းဆိုတဲ့ လူနဲ့ ဆုံပြီးတဲ့ နောက်မှာသူကံကြမ္မာက ပြောင်းလဲဖို့ဖြစ်လာခဲ့ပါတယ်။ဆောင်းဖြောင်းရဲ့မိတ်ဆက်ပေးမှုနဲ့ Adventure Mဆိုတဲ့ရည်းစားရှာဖွေရေး အချစ်ရေး ဝန်ဆောင်မှု Websiteကို စာရင်းသွင်းလိုက်ရာကနေသူ ဘဝထဲကို မြိုယောင်းဆိုတဲ့ မိန်းမချောလေးတစ်ယောက်ကလည်းဝင်ရောက်လာပါတယ်။မြိုယောင်းနဲ့သူဘယ်လို ခရီးဆက်ကြမလဲ။အချစ်ဦး ဟီယွန်းနဲ့ကော ဆုံနိုင်ပါ့မလား။ဖုန်းထဲကနေ တစ်ဆင့် ညွှန်ကြားချက်တွေ ပေးနေတဲ့Adventure M ဆိုတဲ့ လမ်းညွှန်ပေးတဲ့သူကကော ဘယ်သူဖြစ်လာမလဲ။စိတ်ဝင်စားဖို့ကောင်းသလို ရီလည်းရီရတဲ့ 18+ကားလေးတစ်ကားပါ။အချစ်အတွက်ရှုံးနေတဲ့သူတွေ၊အသဲကွဲနေတဲ့သူတွေ ကြည့်ပြီးမိန်းကလေးတွေရဲ့ သဘောကိုနားလည်အောင်လေ့လာလို့ရပါတယ်။18+သီးသန့်မဟုတ်ပဲဇာတ်လမ်းသွားလေးနဲ့ Ro ဆန်ဆန် ကြည့်ချင်တယ်ဆိုရင်တော့
crd cm"
},
{
"title":"18+ Beauty Salon Special Service 4 (2020)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/11/gmv51zfflwb4.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/11/gmv51zfflwb4.jpg",
"cate":"Korea,18+",
"runtime":"",
"links":[
{"type":"HD 249MB", "link":"https://megaup.net/1zGnt/Beauty_Salon_Special_Service_4_720p_(2020)_%7BDS%7D.mp4"},
{"type":"FHD 669MB", "link":"https://megaup.net/1zGnn/Beauty_Salon_Special_Service_4_(2020)_%7BDS%7D.mp4"}
],
"review":"Special Service 4(2020) 18+
ဆိုဇာတ်လမ်းသွားနဲ့ အနုအရွခံစားချင်တယ်ဆိုတဲ့ ဘဒိုတွေအတွက် ကိုရီးယား 18+လေးလာပါပြီDarksite ကိုရီးယား အားပေးတဲ့ အမျိုးသားထုကြီးအတွက် ဒီတစ်ခါထူးထူးခြားခြား Service ပေးတဲ့ အလှပြင်ဆိုင်လေးနဲ့မိတ်ဆက်ပေးချင်ပါတယ်။Stay Home မှာဆံပင်တွေရှည်နေလို့ ညှပ်ချင်တယ်ဆိုတဲ့ ဘဒိုတွေ ဒီကားကြည့်ပြီး ဒီဆိုင်မှာပဲ ညှပ်ချင်တယ်ဖြစ်သွားစေရမယ်။ဇာတ်လမ်းကတော့ ပါလေရာကျော်ကြီးနဲ့ အပေါင်းအပါများရဲ့ ဆံပင်ညှပ်ဆိုင် အလှူပေးရေး ဇာတ်ကြောင်းလေးပေါ့။ဇာတ်လမ်းလေးက ဒီလိုစတယ်။ဧည့်သည်မကျ ဝင်ငွေမကောင်း ဆိုင်လခပေးဖို့အခက်ကြုံနေတဲ့ ဆံပင်ညှပ်ဆိုင်က လုံးကြီးပေါက်လှ သူဠေးမမနဲ့
လက်ထောက်ဂစ်တာရှိတ် ကောင်မလေးတို့က အကြံကုန်ဂဠုန်ဆားချက် အင်တာနက်မှာ ခေတ်စားနေတဲ့ အထူးအစီအစဉ်လေးတစ်ခု
လုပ်ပြီး ယောက်ျားလေးဖောက်သည်တွေကို ဆွဲဆောင်ဖို့ အစီအစဉ်စဆွဲပါတော့တယ်။သူရဲ့အထူးအစီအစဉ်ကဘာလဲ ဆိုတော့ ဆံပင်လာညှပ်တဲ့ ဘဲတွေကို ဘီကီနီလေးဝတ်ပြီးတော့ ဧည့်ခံကြိုဆိုမယ့်အပြင် After Serviceတွေပါ အပြည့်အဝပေးအုန်းမှာ။ကဲ ဘယ်လိုလဲဆံပင်ညှပ်ချင်သွားပြီမလား ငါးကောင်တို့။ကိုရီးယားကားဆို ဇာတ်လမ်းထက်ဆော်လေးတွေပဲစိတ်ဝင်စားတဲ့ ဘဒိုတွေအတွက် ကြည့်ရတာတန်အောင်ဆော် review လေးပေးခဲ့မယ်။ကိုရီးယားမတွေထုံးစံအတိုင်း ဖွေးအုနေတာတော့ ထုံးစံပဲ။သူဠေးမမက အသက်နည်းနည်းရပြီဆိုပေမယ့် ပေါက်စီကအတော်ကိတ်တယ်။ လုံးဝ Sလိုင်း။ပြီးတော့ ဆော်ကြီးကအတော်ထန်တယ်ပြောရမယ်။အငယ်လက်ထောက်မလေးကတော့ နုနုငယ်ငယ် ချွဲချွဲနွဲ့နွဲ့ အကဲပိုတယ်။ဉာဏ်လည်းများသလိုအပြုအစုလည်းကောင်းတယ်။သူလည်း ပေါက်စီက တော်တော်ကိတ်တယ်။လုံးဝအသန့်တစ်လိုင်း။ကဲ ဒီလောက်ဆို သိုင်းဆရာတို့အတွက်ရှယ်ဆိုတာ သိပ်ညွှန်းစရာမလိုတော့ဘူး။ကိုယ်တိုင်သာဒေါင်းကြည့်စေချင်တယ်။
crd cm"
},
{
"title":"[21+] My Girlfriend’s Older Sister,Misaki Honda [PPPD-531]",
"poster":"https://channelmyanmar.org/wp-content/uploads/2020/12/91yPC-t9VML._AC_SL1500_.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2020/12/pppd00531jp-9-768x514.jpg",
"cate":"Japan,uncensored,21+",
"runtime":"2 hr",
"links":[
{"type":"HD 1.2GB", "link":"https://upstream.to/1b705d0yzenu"},
{"type":"HD 1.2GB", "link":"https://megaup.net/1Aqyd/[DS][PPPD-531]_My_Girlfriend%E2%80%99s_Older_Sister,Misaki_Honda_720p.mp4"},
{"type":"FHD 2.5GB", "link":"https://megaup.net/Ut65/[DS][PPPD-531]_My_Girlfriend%E2%80%99s_Older_Sister,Misaki_Honda_1080p.mp4"}
],
"review":"Dark Side production မှ တင်ဆက်သည်။
ဒီဇာတ်ကားကို Decensored Version နဲ့တင်ထားတာမို့ ဆင်ဆာမပါသလိုမျိုးတွေ မြင်ရဖို့ရှိပါတဘ်။This dude has been dating her girlfriend Erina for the last 6 months and on a night out drinking, she gets smashing drunk.He has to carry her back home and once in the house, he meets for the first time with Erina’s older sister, Misaki Honda. And exceptionally voluptuous and horny sister that instantly likes him.He also likes her, because unlike the girlfriend, Sister Misaki Honda can’t be bothered about condoms…
crd cm"
},
{
"title":"[18+] Step Up Love Story (2011)",
"poster":"https://channelmyanmar.org/wp-content/uploads/2018/02/224930876447995128_13608651_c.jpg",
"cover":"https://channelmyanmar.org/wp-content/uploads/2018/02/l3eut79sahqh.jpg",
"cate":"Japan,18+",
"runtime":"1 hr 13 min",
"links":[
{"type":"HD 800MB", "link":"https://megaup.net/Uep2/Step_Up_Love_Story_(Futari_Ecchi)_[18+]_[2011]_(MM_Sub).mp4"},
{"type":"HD 800MB", "link":"https://upstream.to/21bznib5xefo"}
],
"review":"ဇာတ်လမ်းကတော့….
အချစ်ကို အချစ်လို့သာသိပြီး အဘာကြီးဘာနေကြတဲ့ သူငယ်ချင်းတွေကြား ဘာအတွေ့အကြုံမှ မရှိသေးတဲ့ စုံတွဲလေးအကြောင်းကို သာသာယာယာလေး ပြသွားမယ့် ဇာတ်လမ်းလေးကို ချပြလတ်ပါပြီ…..
Living Together ခေတ်ကြီးမှာ… ခုတွေ့ ခုချစ် ခုယူ ဖြစ်သွားခဲ့တဲ့ မာကိုတိုတို့ စုံတွဲဟာ မီးဖိုချောင် ကိစ္စကအစ အိမ်ထောင်ရေး သုခအဆုံး နကန်းတစ်လုံးမှ မသိကြသေးပါဘူး…
ဒါကို ရိပ်မိကြတဲ့ အပေါင်းအသင်းတွေက သူတို့ရဲ့ အတွေ့အကြုံတွေနဲ့ သင်တန်းပို့ချပေးကြပါတယ်..ကောင်မလေးဖက်က သူငယ်ချင်းကလည်း ထိုနည်း၎င်း လမ်းပြကြတယ် ဆိုပါတော့…ကြားသမျှလေးတွေနဲ့ လက်တည့်စမ်းတဲ့ မာကိုတိုနဲ့ အကြံပေးတိုင်း လိုက်လုပ်ရှာတဲ့ သူ့ချစ်ဇနီးလေးတို့ အဆင်ပဲပြေကြမလား၊ အောင့်အီးသည်းခံတွေပဲ ဖြစ်မလား ဆိုတာကတော့ ကိုယ့်လူတို့ လက်တွေ့ဒေါင်းကြည့်လိုက်ကြတော့ဗျာ…။
crd cm"
}
]